[Killed] BooleanLiteral
src/presentation/http/auth.ts:29:43
   return async function authPreHandler(req: FastifyRequest): Promise<void> {
     const authHeader = req.headers.authorization;
 
-    if (typeof authHeader !== 'string' || !authHeader.startsWith('Bearer ')) {
+    if (typeof authHeader !== 'string' || authHeader.startsWith('Bearer ')) {
       throw UnauthorizedError.missingAuthorizationHeader();
     }
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 401 to be 200 // Object.is equality

[Killed] MethodExpression
src/presentation/http/auth.ts:29:44
   return async function authPreHandler(req: FastifyRequest): Promise<void> {
     const authHeader = req.headers.authorization;
 
-    if (typeof authHeader !== 'string' || !authHeader.startsWith('Bearer ')) {
+    if (typeof authHeader !== 'string' || !authHeader.endsWith('Bearer ')) {
       throw UnauthorizedError.missingAuthorizationHeader();
     }
killedBy: GET /duplicates/matches resolves scope via scopeResolver and maps matches to the wire format
statusReason: expected 401 to be 200 // Object.is equality

[Killed] MethodExpression
src/presentation/http/auth.ts:33:20
       throw UnauthorizedError.missingAuthorizationHeader();
     }
 
-    const rawKey = authHeader.slice('Bearer '.length).trim();
+    const rawKey = authHeader.slice('Bearer '.length);
 
     if (rawKey.length === 0) {
killedBy: requireScope rejects an empty API key after the Bearer prefix
statusReason: expected [Function] to throw error including 'empty API key' but got 'invalid or revoked API key'

[Killed] MethodExpression
src/presentation/http/auth.ts:33:20
       throw UnauthorizedError.missingAuthorizationHeader();
     }
 
-    const rawKey = authHeader.slice('Bearer '.length).trim();
+    const rawKey = authHeader.trim();
 
     if (rawKey.length === 0) {
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BlockStatement
src/presentation/http/auth.ts:35:30
 
     const rawKey = authHeader.slice('Bearer '.length).trim();
 
-    if (rawKey.length === 0) {
-      throw UnauthorizedError.emptyApiKey();
-    }
+    if (rawKey.length === 0) {}
 
     const apiClient = await apiClients.findByKeyHash(sha256Hex(rawKey));
killedBy: requireScope rejects an empty API key after the Bearer prefix
statusReason: expected [Function] to throw error including 'empty API key' but got 'invalid or revoked API key'

[Killed] ConditionalExpression
src/presentation/http/auth.ts:35:9
 
     const rawKey = authHeader.slice('Bearer '.length).trim();
 
-    if (rawKey.length === 0) {
+    if (false) {
       throw UnauthorizedError.emptyApiKey();
     }
killedBy: requireScope rejects an empty API key after the Bearer prefix
statusReason: expected [Function] to throw error including 'empty API key' but got 'invalid or revoked API key'

[Killed] ConditionalExpression
src/presentation/http/auth.ts:45:9
       throw UnauthorizedError.invalidApiKey();
     }
 
-    if (!hasScope(apiClient, scope)) {
+    if (false) {
       throw ForbiddenError.missingScope(scope);
     }
killedBy: requireScope rejects a valid key lacking the required scope
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/presentation/http/auth.ts:45:38
       throw UnauthorizedError.invalidApiKey();
     }
 
-    if (!hasScope(apiClient, scope)) {
-      throw ForbiddenError.missingScope(scope);
-    }
+    if (!hasScope(apiClient, scope)) {}
 
     req.apiClient = apiClient;
killedBy: POST /assets rejects a token lacking the assets:write scope
statusReason: expected 500 to be 403 // Object.is equality
