[Killed] BooleanLiteral
src/application/service/projectStats.service.ts:131:19
         edgeCount: 0,
         assetsWithDuplicateCount: 0,
         assetsWithDuplicatePct: 0,
-        degraded: false,
+        degraded: true,
       };
     }
killedBy: ProjectStatsService.getSummary zero-fills a configured recipe that has never been hashed
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/application/service/projectStats.service.ts:135:52
       };
     }
 
-    if (algorithm.comparison === Comparison.EXACT) {
-      const stats = await this.assetHashes.countExactDuplicateStats(project.id, algorithm.id);
-
-      return this.buildStat(recipe, stats, assetCount);
-    }
+    if (algorithm.comparison === Comparison.EXACT) {}
 
     if (algorithm.comparison === Comparison.HAMMING) {
killedBy: ProjectStatsService.getSummary computes EXACT-recipe duplicate stats from asset_hash-derived counts
statusReason: expected { recipe: 'binary.sha256', …(5) } to deeply equal { recipe: 'binary.sha256', …(5) }

[Killed] BlockStatement
src/application/service/projectStats.service.ts:141:54
       return this.buildStat(recipe, stats, assetCount);
     }
 
-    if (algorithm.comparison === Comparison.HAMMING) {
-      const minSimilarity = project.hammingThreshold ?? this.config.default_hamming_threshold;
-      const stats = await this.clusters.computeStats(project.id, algorithm.id, minSimilarity);
-
-      if (stats === null) {
-        return { recipe, ...DEGRADED_STAT };
-      }
-
-      return this.buildStat(recipe, stats, assetCount);
-    }
+    if (algorithm.comparison === Comparison.HAMMING) {}
 
     // No implementation for this comparison (e.g. cosine) — degrade rather than fail the whole response.
killedBy: ProjectStatsService.getSummary computes HAMMING-recipe duplicate stats via the cluster cache, using project.hammingThreshold as fallback
statusReason: expected { recipe: 'image.phash16', …(5) } to deeply equal { recipe: 'image.phash16', …(5) }

[Killed] ConditionalExpression
src/application/service/projectStats.service.ts:141:9
       return this.buildStat(recipe, stats, assetCount);
     }
 
-    if (algorithm.comparison === Comparison.HAMMING) {
+    if (true) {
       const minSimilarity = project.hammingThreshold ?? this.config.default_hamming_threshold;
       const stats = await this.clusters.computeStats(project.id, algorithm.id, minSimilarity);
killedBy: ProjectStatsService.getSummary degrades gracefully for a comparison with no application-layer implementation
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/application/service/projectStats.service.ts:162:7
     assetCount: number,
   ): DuplicatesPerRecipeStat {
     const assetsWithDuplicatePct =
-      assetCount > 0 ? Math.round((stats.assetsWithDuplicateCount / assetCount) * 10000) / 100 : 0;
+      assetCount >= 0 ? Math.round((stats.assetsWithDuplicateCount / assetCount) * 10000) / 100 : 0;
 
     return {
killedBy: ProjectStatsService.getSummary reports a 0% pct (not NaN/divide-by-zero) when the recipe has an algorithm but zero counted assets
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/application/service/projectStats.service.ts:162:35
     assetCount: number,
   ): DuplicatesPerRecipeStat {
     const assetsWithDuplicatePct =
-      assetCount > 0 ? Math.round((stats.assetsWithDuplicateCount / assetCount) * 10000) / 100 : 0;
+      assetCount > 0 ? Math.round(stats.assetsWithDuplicateCount / assetCount / 10000) / 100 : 0;
 
     return {
killedBy: ProjectStatsService.getSummary computes EXACT-recipe duplicate stats from asset_hash-derived counts
statusReason: expected { recipe: 'binary.sha256', …(5) } to deeply equal { recipe: 'binary.sha256', …(5) }

[Killed] BooleanLiteral
src/application/service/projectStats.service.ts:170:17
       edgeCount: stats.edgeCount,
       assetsWithDuplicateCount: stats.assetsWithDuplicateCount,
       assetsWithDuplicatePct,
-      degraded: false,
+      degraded: true,
     };
   }
killedBy: ProjectStatsService.getSummary computes EXACT-recipe duplicate stats from asset_hash-derived counts
statusReason: expected { recipe: 'binary.sha256', …(5) } to deeply equal { recipe: 'binary.sha256', …(5) }
