[Timeout] BlockStatement
src/infrastructure/drizzle/errors.ts:15:36
 export function isUniqueError(err: unknown): boolean {
   let current: unknown = err;
 
-  while (current instanceof Error) {
-    if ((current as { code?: unknown }).code === UNIQUE_VIOLATION_CODE) {
-      return true;
-    }
-    current = current.cause;
-  }
+  while (current instanceof Error) {}
 
   return false;

[Killed] ConditionalExpression
src/infrastructure/drizzle/errors.ts:16:9
   let current: unknown = err;
 
   while (current instanceof Error) {
-    if ((current as { code?: unknown }).code === UNIQUE_VIOLATION_CODE) {
+    if (false) {
       return true;
     }
killedBy: DrizzleProjectRepository rejects creating a project with a duplicate slug as AlreadyExistsError
statusReason: expected error to be instance of AlreadyExistsError

[Killed] BlockStatement
src/infrastructure/drizzle/errors.ts:16:73
   let current: unknown = err;
 
   while (current instanceof Error) {
-    if ((current as { code?: unknown }).code === UNIQUE_VIOLATION_CODE) {
-      return true;
-    }
+    if ((current as { code?: unknown }).code === UNIQUE_VIOLATION_CODE) {}
     current = current.cause;
   }
killedBy: DrizzleProjectRepository rejects creating a project with a duplicate slug as AlreadyExistsError
statusReason: expected error to be instance of AlreadyExistsError

[Killed] BooleanLiteral
src/infrastructure/drizzle/errors.ts:17:14
 
   while (current instanceof Error) {
     if ((current as { code?: unknown }).code === UNIQUE_VIOLATION_CODE) {
-      return true;
+      return false;
     }
     current = current.cause;
killedBy: DrizzleProjectRepository rejects creating a project with a duplicate slug as AlreadyExistsError
statusReason: expected error to be instance of AlreadyExistsError
