[Killed] ConditionalExpression
infrastructure/drizzle/repository/apiClient.repository.ts:33:11
 
       return row;
     } catch (err) {
-      if (isUniqueError(err)) {
+      if (true) {
         throw AlreadyExistsError.apiClient(params.name);
       }
killedBy: DrizzleApiClientRepository re-throws a non-unique-violation error as-is (e.g. a foreign key violation)
statusReason: expected AlreadyExistsError: API client 'ci' alrea… to not be an instance of AlreadyExistsError

[Killed] BlockStatement
infrastructure/drizzle/repository/apiClient.repository.ts:33:31
 
       return row;
     } catch (err) {
-      if (isUniqueError(err)) {
-        throw AlreadyExistsError.apiClient(params.name);
-      }
+      if (isUniqueError(err)) {}
 
       throw err;
killedBy: DrizzleApiClientRepository rejects creating a second active client with the same name in the same project
statusReason: expected error to be instance of AlreadyExistsError

[Killed] BlockStatement
infrastructure/drizzle/repository/apiClient.repository.ts:63:43
     return row ?? null;
   }
 
-  async revoke(id: string): Promise<void> {
-    const [row] = await this.db
-      .update(apiClientTable)
-      .set({ revokedAt: new Date() })
-      .where(and(eq(apiClientTable.id, id), isNull(apiClientTable.revokedAt)))
-      .returning({ id: apiClientTable.id });
-
-    if (row === undefined) {
-      throw NotFoundError.apiClient(id);
-    }
-  }
+  async revoke(id: string): Promise<void> {}
 
   async listByProject(projectId: string): Promise<ApiClient[]> {
killedBy: DrizzleApiClientRepository findByKeyHash does not return a revoked client
statusReason: expected { …(7) } to be null

[Killed] ObjectLiteral
infrastructure/drizzle/repository/apiClient.repository.ts:66:12
   async revoke(id: string): Promise<void> {
     const [row] = await this.db
       .update(apiClientTable)
-      .set({ revokedAt: new Date() })
+      .set({})
       .where(and(eq(apiClientTable.id, id), isNull(apiClientTable.revokedAt)))
       .returning({ id: apiClientTable.id });
killedBy: DrizzleApiClientRepository findByKeyHash does not return a revoked client
statusReason: No values to set

[Killed] BlockStatement
infrastructure/drizzle/repository/apiClient.repository.ts:70:28
       .where(and(eq(apiClientTable.id, id), isNull(apiClientTable.revokedAt)))
       .returning({ id: apiClientTable.id });
 
-    if (row === undefined) {
-      throw NotFoundError.apiClient(id);
-    }
+    if (row === undefined) {}
   }
 
killedBy: DrizzleApiClientRepository revoke throws NotFoundError for a nonexistent client
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
infrastructure/drizzle/repository/apiClient.repository.ts:70:9
       .where(and(eq(apiClientTable.id, id), isNull(apiClientTable.revokedAt)))
       .returning({ id: apiClientTable.id });
 
-    if (row === undefined) {
+    if (false) {
       throw NotFoundError.apiClient(id);
     }
killedBy: DrizzleApiClientRepository revoke throws NotFoundError for a nonexistent client
statusReason: promise resolved "undefined" instead of rejecting
