[Killed] BlockStatement
infrastructure/drizzle/repository/asset.hashDuplicate.repository.ts:33:96
 
   /** One upserted row per matching asset per direction, written together (symmetric distance/similarity)
    * — lets every read join/group on `asset_id` alone, no UNION. */
-  async recomputeExact(projectId: string, algorithmId: number, assetId: string): Promise<void> {
-    await this.db.execute(sql`
-      WITH new_hashes AS (
-        SELECT hash FROM asset_hash WHERE asset_id = ${assetId} AND algorithm_id = ${algorithmId}
-      ),
-      matches AS (
-        SELECT DISTINCT ah.asset_id AS other_asset_id
-        FROM asset_hash ah
-        JOIN asset a ON a.id = ah.asset_id
-        JOIN new_hashes nh ON nh.hash = ah.hash
-        WHERE a.project_id = ${projectId} AND ah.algorithm_id = ${algorithmId} AND ah.asset_id <> ${assetId}
-      )
-      INSERT INTO asset_hash_duplicate (algorithm_id, asset_id, other_asset_id, distance, similarity, computed_at)
-      SELECT ${algorithmId}::integer, ${assetId}::uuid, other_asset_id, 0, 100, now() FROM matches
-      UNION ALL
-      SELECT ${algorithmId}::integer, other_asset_id, ${assetId}::uuid, 0, 100, now() FROM matches
-      ON CONFLICT (algorithm_id, asset_id, other_asset_id)
-      DO UPDATE SET distance = 0, similarity = 100, computed_at = EXCLUDED.computed_at
-    `);
-
-    await this.clusterWriter.bumpGeneration(projectId, algorithmId);
-  }
+  async recomputeExact(projectId: string, algorithmId: number, assetId: string): Promise<void> {}
 
   /** Hamming distance via bit_count()/XOR (PG14+); both directions written together, see {@link recomputeExact}. */
killedBy: DrizzleAssetHashDuplicateSearchRepository paginateMatches paginates via Page
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.hashDuplicate.repository.ts:102:76
   /** Both directional rows reference `assetId`. Must run while its `asset` row still exists (see
    * {@link bumpGenerationForAsset}) — every current call site already calls this before removing the
    * asset, so this just makes that a hard requirement rather than an accident of call order. */
-  async deleteByAsset(algorithmId: number, assetId: string): Promise<void> {
-    await this.db
-      .delete(assetHashDuplicateTable)
-      .where(
-        and(
-          eq(assetHashDuplicateTable.algorithmId, algorithmId),
-          or(eq(assetHashDuplicateTable.assetId, assetId), eq(assetHashDuplicateTable.otherAssetId, assetId)),
-        ),
-      );
-
-    await this.clusterWriter.bumpGenerationForAsset(algorithmId, assetId);
-  }
+  async deleteByAsset(algorithmId: number, assetId: string): Promise<void> {}
 
   /** Every row's own `asset_id` is in-project (matches never cross projects), so this alone is sufficient. */
killedBy: DrizzleAssetHashDuplicateRepository deleteByAsset removes rows touching the asset from either side, scoped to the algorithm
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal []

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.hashDuplicate.repository.ts:116:80
   }
 
   /** Every row's own `asset_id` is in-project (matches never cross projects), so this alone is sufficient. */
-  async deleteByProject(projectId: string, algorithmId: number): Promise<void> {
-    await this.db.execute(sql`
-      DELETE FROM asset_hash_duplicate d
-      USING asset a
-      WHERE a.id = d.asset_id AND a.project_id = ${projectId} AND d.algorithm_id = ${algorithmId}
-    `);
-
-    await this.clusterWriter.bumpGeneration(projectId, algorithmId);
-  }
+  async deleteByProject(projectId: string, algorithmId: number): Promise<void> {}
 
   /** Each edge is stored as two directional rows; `asset_id < other_asset_id` keeps this at one row per edge. */
killedBy: DrizzleAssetHashDuplicateRepository deleteByProject clears all rows for (project, algorithm) without touching other algorithms
statusReason: expected [ Array(1) ] to deeply equal []

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.repository.ts:178:36
       return [];
     }
 
-    const self = alias(assetTable, 'asset_self');
+    const self = alias(assetTable, "");
     const other = alias(assetTable, 'asset_other');
 
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate counts and ranks assets by duplicate count, descending, tie-broken by identity
statusReason: params: ,1096c315-f167-47e1-9a05-40982789be94,1,0,a,b,c

[Killed] ArrowFunction
infrastructure/drizzle/repository/asset.hashDuplicate.repository.ts:198:32
           eq(self.projectId, projectId),
           eq(assetHashDuplicateTable.algorithmId, algorithmId),
           gte(assetHashDuplicateTable.similarity, minSimilarity),
-          or(...identities.map((identity) => identityCondition(self, identity))),
+          or(...identities.map(() => undefined)),
         ),
       );
killedBy: DrizzleAssetHashDuplicateRepository recomputeExact creates a distance-0/similarity-100 row for assets sharing a hash
statusReason: expected [ { …(4) }, { …(4) } ] to deeply equal [ Array(1) ]

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.repository.ts:213:35
   /** Same dedup filter as `findByProject` — counts each directional pair once. */
   async countPairsByProject(projectId: string): Promise<number> {
     const [row] = await this.db
-      .select({ value: sql<number>`count(*)::int`.as('value') })
+      .select({ value: sql<number>``.as('value') })
       .from(assetHashDuplicateTable)
       .innerJoin(assetTable, eq(assetTable.id, assetHashDuplicateTable.assetId))
killedBy: DrizzleAssetHashDuplicateRepository countPairsByProject counts distinct pairs once, not the doubled directional row count
statusReason: promise rejected "Error: Failed query: select  as "value" f… { …(2) }" instead of resolving
