[Killed] LogicalOperator
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:63:39
   // only has to be *consistent* between the write and read side of the map, and the DB's own unique indexes
   // on `(project, identity_id)`/`(project, identity_path)` mean two distinct real assets can never share the
   // field that's present, so no legitimate test data can make the fallback text matter.
-  return `${identity.id ?? ''}\u0000${identity.path ?? ''}`;
+  return `${identity.id ?? ''}\u0000${identity.path && ''}`;
 }
 
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate keeps matches separate for two different path-only assets, not just id-based ones
statusReason: expected [ { …(3) }, { …(3) } ] to deeply equal [ Array(1) ]

[Killed] LogicalOperator
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:63:13
   // only has to be *consistent* between the write and read side of the map, and the DB's own unique indexes
   // on `(project, identity_id)`/`(project, identity_path)` mean two distinct real assets can never share the
   // field that's present, so no legitimate test data can make the fallback text matter.
-  return `${identity.id ?? ''}\u0000${identity.path ?? ''}`;
+  return `${identity.id && ''}\u0000${identity.path ?? ''}`;
 }
 
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate fills in matches per asset via one batched findByAssets call, sorted by descending similarity
statusReason: expected [ { …(3) }, { …(3) } ] to deeply equal [ Array(1) ]

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:104:30
   ): Promise<Map<string, DuplicateMatch[]>> {
     const matchesByAsset = new Map<string, DuplicateMatch[]>();
 
-    if (ranked.length === 0) {
-      return matchesByAsset;
-    }
+    if (ranked.length === 0) {}
 
     const matchRows = await this.assetHashDuplicates.findByAssets(
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate returns the canonical empty result when nothing matches, without calling findByAssets
statusReason: expected "findByAssets" to not be called at all, but actually been called 1 times

Received:

  1st findByAssets call:

    Array [
      "9c2288f1-2a29-4cf8-843f-9700777b515a",

[Killed] ConditionalExpression
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:104:9
   ): Promise<Map<string, DuplicateMatch[]>> {
     const matchesByAsset = new Map<string, DuplicateMatch[]>();
 
-    if (ranked.length === 0) {
+    if (false) {
       return matchesByAsset;
     }
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate returns the canonical empty result when nothing matches, without calling findByAssets
statusReason: expected "findByAssets" to not be called at all, but actually been called 1 times

Received:

  1st findByAssets call:

    Array [
      "35dc7fcc-7d65-43d7-bd4d-088e0385d393",

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:115:32
       query.minSimilarity,
     );
 
-    matchRows.forEach((row) => {
-      const key = identityKey(row.identity);
-      const list = matchesByAsset.get(key) ?? [];
-      list.push({ identity: row.otherIdentity, distance: row.distance, similarity: row.similarity });
-      matchesByAsset.set(key, list);
-    });
+    matchRows.forEach((row) => {});
 
     return matchesByAsset;
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate fills in matches per asset via one batched findByAssets call, sorted by descending similarity
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] CallExpression
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:119:7
       const key = identityKey(row.identity);
       const list = matchesByAsset.get(key) ?? [];
       list.push({ identity: row.otherIdentity, distance: row.distance, similarity: row.similarity });
-      matchesByAsset.set(key, list);
+      ;
     });
 
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate fills in matches per asset via one batched findByAssets call, sorted by descending similarity
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:149:37
   return new DrizzleSimpleAdapter(
     () =>
       db
-        .select({ count: sql<number>`count(distinct ${assetTable.id})::int`.as('count') })
+        .select({ count: sql<number>``.as('count') })
         .from(assetHashDuplicateTable)
         .innerJoin(assetTable, eq(assetTable.id, assetHashDuplicateTable.assetId))
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate counts and ranks assets by duplicate count, descending, tie-broken by identity
statusReason: Failed query: select  as "count" from "asset_hash_duplicate" inner join "asset" on "asset"."id" = "asset_hash_duplicate"."asset_id" where ("asset"."project_id" = $1 and "asset_hash_duplicate"."algorithm_id" = $2 and "asset_hash_duplicate"."similarity" >= $3)
params: 9cb3a062-92ba-4e85-a8b1-987fbfcd9716,1,0

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:160:38
         .select({
           identityId: assetTable.identityId,
           identityPath: assetTable.identityPath,
-          duplicateCount: sql<number>`count(*)::int`.as('duplicate_count'),
+          duplicateCount: sql<number>``.as('duplicate_count'),
         })
         .from(assetHashDuplicateTable)
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate counts and ranks assets by duplicate count, descending, tie-broken by identity
statusReason: params: 319de0b0-0261-4901-98f0-8d9914091b13,1,0,10

[Killed] MethodExpression
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:179:19
 ): AssetWithDuplicateCount {
   /* v8 ignore next -- unreachable: findByAssets uses the same minSimilarity filter as the ranking
      query, so every asset here (duplicateCount > 0) always has >=1 entry in matchesByAsset */
-  const matches = (matchesByAsset.get(identityKey(ranked.identity)) ?? []).sort((a, b) => b.similarity - a.similarity);
+  const matches = matchesByAsset.get(identityKey(ranked.identity)) ?? [];
   // Stryker disable next-line ConditionalExpression: `.slice(0, undefined)` returns the whole array per JS
   // spec, identical to not slicing at all — so this guard is unobservable when matchLimit is undefined;
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate sorts an asset's matches by descending similarity when it has more than one
statusReason: expected 87.5 to be greater than or equal to 93.8

[Killed] ArithmeticOperator
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:179:91
 ): AssetWithDuplicateCount {
   /* v8 ignore next -- unreachable: findByAssets uses the same minSimilarity filter as the ranking
      query, so every asset here (duplicateCount > 0) always has >=1 entry in matchesByAsset */
-  const matches = (matchesByAsset.get(identityKey(ranked.identity)) ?? []).sort((a, b) => b.similarity - a.similarity);
+  const matches = (matchesByAsset.get(identityKey(ranked.identity)) ?? []).sort((a, b) => b.similarity + a.similarity);
   // Stryker disable next-line ConditionalExpression: `.slice(0, undefined)` returns the whole array per JS
   // spec, identical to not slicing at all — so this guard is unobservable when matchLimit is undefined;
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate sorts an asset's matches by descending similarity when it has more than one
statusReason: expected 87.5 to be greater than or equal to 93.8

[Killed] EqualityOperator
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:183:19
   // Stryker disable next-line ConditionalExpression: `.slice(0, undefined)` returns the whole array per JS
   // spec, identical to not slicing at all — so this guard is unobservable when matchLimit is undefined;
   // `caps matches per asset at matchLimit` already covers the defined case.
-  const limited = matchLimit !== undefined ? matches.slice(0, matchLimit) : matches;
+  const limited = matchLimit === undefined ? matches.slice(0, matchLimit) : matches;
 
   return {
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate caps matches per asset at matchLimit
statusReason: expected [ { …(3) }, { …(3) } ] to have a length of 1 but got 2

[Killed] MethodExpression
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:183:46
   // Stryker disable next-line ConditionalExpression: `.slice(0, undefined)` returns the whole array per JS
   // spec, identical to not slicing at all — so this guard is unobservable when matchLimit is undefined;
   // `caps matches per asset at matchLimit` already covers the defined case.
-  const limited = matchLimit !== undefined ? matches.slice(0, matchLimit) : matches;
+  const limited = matchLimit !== undefined ? matches : matches;
 
   return {
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate caps matches per asset at matchLimit
statusReason: expected [ { …(3) }, { …(3) } ] to have a length of 1 but got 2

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:196:34
   db: DbClient,
   query: AssetHashDuplicateMatchesQuery,
 ): DrizzleSimpleAdapter<{ count: number }, RawDuplicateMatchRow> {
-  const self = alias(assetTable, 'asset_self');
+  const self = alias(assetTable, "");
   const other = alias(assetTable, 'asset_other');
   const scope: SQL | undefined = and(
killedBy: DrizzleAssetHashDuplicateSearchRepository paginateMatches returns one asset's matches, sorted by descending similarity
statusReason: params: ,4c4f5417-ff14-421d-98d8-91e6955fd2ef,a,1,0

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:197:35
   query: AssetHashDuplicateMatchesQuery,
 ): DrizzleSimpleAdapter<{ count: number }, RawDuplicateMatchRow> {
   const self = alias(assetTable, 'asset_self');
-  const other = alias(assetTable, 'asset_other');
+  const other = alias(assetTable, "");
   const scope: SQL | undefined = and(
     eq(self.projectId, query.projectId),
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 500 to be 200 // Object.is equality

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:208:56
   return new DrizzleSimpleAdapter(
     () =>
       db
-        .select({ count: sql<number>`count(*)::int`.as('count') })
+        .select({ count: sql<number>`count(*)::int`.as("") })
         .from(assetHashDuplicateTable)
         .innerJoin(self, eq(self.id, assetHashDuplicateTable.assetId))
killedBy: DrizzleAssetHashDuplicateSearchRepository paginateMatches returns one asset's matches, sorted by descending similarity
statusReason: params: 32dc9d2a-83fe-4f41-8545-8a0330f9e62e,a,1,0

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:208:37
   return new DrizzleSimpleAdapter(
     () =>
       db
-        .select({ count: sql<number>`count(*)::int`.as('count') })
+        .select({ count: sql<number>``.as('count') })
         .from(assetHashDuplicateTable)
         .innerJoin(self, eq(self.id, assetHashDuplicateTable.assetId))
killedBy: DrizzleAssetHashDuplicateSearchRepository paginateMatches returns one asset's matches, sorted by descending similarity
statusReason: params: 3b8aafd7-e0ae-4830-a81d-1d8f8897e8df,a,1,0

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.hashDuplicate.search.repository.ts:228:21
         .innerJoin(other, eq(other.id, assetHashDuplicateTable.otherAssetId))
         .$dynamic()
         .where(scope)
-        .orderBy(sql`similarity desc`),
+        .orderBy(sql``),
   );
 }
killedBy: DrizzleAssetHashDuplicateSearchRepository paginateMatches returns one asset's matches, sorted by descending similarity
statusReason: params: 9d9bc8a4-e3b0-4da4-81fc-ed7edb20a3e4,a,1,0,10
