[Killed] ConditionalExpression
infrastructure/drizzle/repository/asset.repository.ts:29:7
 
 /** `id` takes priority over `path` — see `Identity`'s doc comment for why a lookup only ever uses one. */
 export function identityCondition(asset: AssetIdentityColumns, identity: Identity): SQL {
-  if (identity.id !== null) {
+  if (false) {
     return eq(asset.identityId, identity.id);
   }
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate counts and ranks assets by duplicate count, descending, tie-broken by identity
statusReason: unreachable: Identity with neither id nor path

[Killed] EqualityOperator
infrastructure/drizzle/repository/asset.repository.ts:29:7
 
 /** `id` takes priority over `path` — see `Identity`'s doc comment for why a lookup only ever uses one. */
 export function identityCondition(asset: AssetIdentityColumns, identity: Identity): SQL {
-  if (identity.id !== null) {
+  if (identity.id === null) {
     return eq(asset.identityId, identity.id);
   }
killedBy: DrizzleClusterRepository countEdges counts each undirected pair once
statusReason: unreachable: Identity with neither id nor path

[Killed] EqualityOperator
infrastructure/drizzle/repository/asset.repository.ts:38:7
   // invariant the v8 ignore explains.
   /* v8 ignore else -- unreachable: Identity's own constructor guarantees id and path are not both null,
    * so if id is null here, path is always non-null. */
-  if (identity.path !== null) {
+  if (identity.path === null) {
     return eq(asset.identityPath, identity.path);
   }
killedBy: DrizzleAssetRepository findByIdentity / getByIdentity finds an existing asset by path
statusReason: promise rejected "Error: unreachable: Identity with neither…" instead of resolving

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.repository.ts:38:31
   // invariant the v8 ignore explains.
   /* v8 ignore else -- unreachable: Identity's own constructor guarantees id and path are not both null,
    * so if id is null here, path is always non-null. */
-  if (identity.path !== null) {
-    return eq(asset.identityPath, identity.path);
-  }
+  if (identity.path !== null) {}
 
   // Stryker disable next-line all: unreachable in practice — guards the type narrowing above, not a code path any test can trigger honestly.
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate attaches matches correctly when the ranked asset is identified by path rather than id
statusReason: unreachable: Identity with neither id nor path

[Killed] EqualityOperator
infrastructure/drizzle/repository/asset.repository.ts:48:28
 }
 
 function isGiven(value: string | null): value is string {
-  return value !== null && value !== '';
+  return value !== null && value === '';
 }
 
killedBy: DrizzleAssetRepository create is idempotent when called again with the same id — no path change when path stays null
statusReason: Failed query: insert into "asset" ("id", "project_id", "identity_id", "identity_path", "created_at", "updated_at") values (default, $1, $2, $3, default, default) returning "id", "project_id", "identity_id", "identity_path", "created_at", "updated_at"
params: dab4e571-22fd-4a25-8a19-34e9ff48ab1f,a1,

[Timeout] ConditionalExpression
infrastructure/drizzle/repository/asset.repository.ts:48:10
 }
 
 function isGiven(value: string | null): value is string {
-  return value !== null && value !== '';
+  return false;
 }
 

[Killed] ConditionalExpression
infrastructure/drizzle/repository/asset.repository.ts:56:7
  * result straight into `new Identity(...)`, whose own constructor normalizes `""` to `null` too, so a black-box
  * test of `create()` alone can't distinguish this function returning `null` from it returning `""` unchanged. */
 export function resolveField(raw: string | null, previous: string | null): string | null {
-  if (raw === null) {
+  if (true) {
     return previous;
   }
killedBy: DrizzleClusterRepository countEdges counts each undirected pair once
statusReason: identity must have at least one of id or path set

[Killed] EqualityOperator
infrastructure/drizzle/repository/asset.repository.ts:56:7
  * result straight into `new Identity(...)`, whose own constructor normalizes `""` to `null` too, so a black-box
  * test of `create()` alone can't distinguish this function returning `null` from it returning `""` unchanged. */
 export function resolveField(raw: string | null, previous: string | null): string | null {
-  if (raw === null) {
+  if (raw !== null) {
     return previous;
   }
killedBy: DrizzleClusterSearchRepository paginate returns one cluster with both members and their avg similarity
statusReason: identity must have at least one of id or path set

[Killed] EqualityOperator
infrastructure/drizzle/repository/asset.repository.ts:60:7
     return previous;
   }
 
-  if (raw === '') {
+  if (raw !== '') {
     return null;
   }
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate counts and ranks assets by duplicate count, descending, tie-broken by identity
statusReason: identity must have at least one of id or path set

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.repository.ts:60:19
     return previous;
   }
 
-  if (raw === '') {
-    return null;
-  }
+  if (raw === '') {}
 
   return raw;
killedBy: resolveField clears the field to null when raw is an explicit empty string, regardless of the previous value
statusReason: expected '' to be null

[Killed] EqualityOperator
infrastructure/drizzle/repository/asset.repository.ts:115:47
         ? await this.findLocked(tx, params.projectId, eq(assetTable.identityPath, params.identityPath))
         : null;
 
-      if (byId !== null && byPath !== null && byId.id !== byPath.id) {
+      if (byId !== null && byPath !== null && byId.id === byPath.id) {
         throw AlreadyExistsError.asset(new Identity(params.identityId, params.identityPath));
       }
killedBy: DrizzleAssetRepository create does not throw AlreadyExistsError when id and path both resolve to the same existing row
statusReason: identity 'id=a1, path=photos/1.jpg' matches two different existing assets (one via id, another via path)

[Killed] ConditionalExpression
infrastructure/drizzle/repository/asset.repository.ts:115:47
         ? await this.findLocked(tx, params.projectId, eq(assetTable.identityPath, params.identityPath))
         : null;
 
-      if (byId !== null && byPath !== null && byId.id !== byPath.id) {
+      if (byId !== null && byPath !== null && true) {
         throw AlreadyExistsError.asset(new Identity(params.identityId, params.identityPath));
       }
killedBy: DrizzleAssetRepository create does not throw AlreadyExistsError when id and path both resolve to the same existing row
statusReason: identity 'id=a1, path=photos/1.jpg' matches two different existing assets (one via id, another via path)

[Killed] LogicalOperator
infrastructure/drizzle/repository/asset.repository.ts:119:24
         throw AlreadyExistsError.asset(new Identity(params.identityId, params.identityPath));
       }
 
-      const previous = byId ?? byPath;
+      const previous = byId && byPath;
       const identity = new Identity(
         resolveField(params.identityId, previous?.identityId ?? null),
killedBy: DrizzleAssetRepository create is idempotent when called again with the same id — no path change when path stays null
statusReason: Failed query: insert into "asset" ("id", "project_id", "identity_id", "identity_path", "created_at", "updated_at") values (default, $1, $2, $3, default, default) returning "id", "project_id", "identity_id", "identity_path", "created_at", "updated_at"
params: 53da47e8-97fd-463d-8111-28a59150d3f1,a1,

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.repository.ts:125:30
         resolveField(params.identityPath, previous?.identityPath ?? null),
       );
 
-      if (previous !== null) {
-        const [row] = await tx
-          .update(assetTable)
-          .set({ identityId: identity.id, identityPath: identity.path, updatedAt: new Date() })
-          .where(eq(assetTable.id, previous.id))
-          .returning();
-
-        /* v8 ignore next 3 -- unreachable: updating by the id of a row just selected in the same tx always returns exactly one row */
-        if (row === undefined) {
-          // Stryker disable next-line all: unreachable — see the v8 ignore above, same reasoning.
-          throw new Error('asset update returned no rows');
-        }
-
-        return { id: row.id, identity };
-      }
+      if (previous !== null) {}
 
       const [row] = await tx
killedBy: DrizzleAssetRepository create is idempotent when called again with the same id — no path change when path stays null
statusReason: Failed query: insert into "asset" ("id", "project_id", "identity_id", "identity_path", "created_at", "updated_at") values (default, $1, $2, $3, default, default) returning "id", "project_id", "identity_id", "identity_path", "created_at", "updated_at"
params: 6906ffea-8bc9-4dca-b4cb-4cf17ca386b3,a1,

[Killed] ObjectLiteral
infrastructure/drizzle/repository/asset.repository.ts:128:16
       if (previous !== null) {
         const [row] = await tx
           .update(assetTable)
-          .set({ identityId: identity.id, identityPath: identity.path, updatedAt: new Date() })
+          .set({})
           .where(eq(assetTable.id, previous.id))
           .returning();
killedBy: DrizzleAssetRepository create is idempotent when called again with the same id — no path change when path stays null
statusReason: No values to set

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.repository.ts:156:80
     });
   }
 
-  async deleteByIdentity(projectId: string, identity: Identity): Promise<void> {
-    await this.db
-      .delete(assetTable)
-      .where(and(eq(assetTable.projectId, projectId), identityCondition(assetTable, identity)));
-  }
+  async deleteByIdentity(projectId: string, identity: Identity): Promise<void> {}
 
   async listRecipes(projectId: string, identity: Identity): Promise<string[]> {
killedBy: end-to-end: upsert an asset, then find it as a duplicate deletes an asset via HTTP; a subsequent duplicates lookup for it 404s
statusReason: expected 200 to be 404 // Object.is equality

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.repository.ts:181:27
   ): Promise<string[]> {
     const conditions = [eq(assetTable.projectId, projectId)];
 
-    if (afterId !== null) {
-      conditions.push(gt(assetTable.id, afterId));
-    }
+    if (afterId !== null) {}
 
     const rows = await this.db
killedBy: DrizzleAssetRepository other repository methods (unaffected by the identity split) listIdsWithHash respects the cursor and batch size for pagination
statusReason: expected 2 to be 4 // Object.is equality

[Killed] CallExpression
infrastructure/drizzle/repository/asset.repository.ts:182:7
     const conditions = [eq(assetTable.projectId, projectId)];
 
     if (afterId !== null) {
-      conditions.push(gt(assetTable.id, afterId));
+      ;
     }
 
killedBy: DrizzleAssetRepository other repository methods (unaffected by the identity split) listIdsWithHash respects the cursor and batch size for pagination
statusReason: expected 2 to be 4 // Object.is equality

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.repository.ts:214:32
     const rows = await this.db
       .select({
         recipe: algorithmTable.recipe,
-        assetCount: sql<number>`count(distinct ${assetHashTable.assetId})::int`.as('asset_count'),
+        assetCount: sql<number>``.as('asset_count'),
       })
       .from(assetHashTable)
killedBy: DrizzleAssetRepository other repository methods (unaffected by the identity split) countPerRecipe returns distinct hashed-asset counts per recipe, omitting recipes with no hashes
statusReason: Failed query: select "algorithm"."recipe",  as "asset_count" from "asset_hash" inner join "asset" on "asset"."id" = "asset_hash"."asset_id" inner join "algorithm" on "algorithm"."id" = "asset_hash"."algorithm_id" where "asset"."project_id" = $1 group by "algorithm"."recipe"
params: 099bf424-25b9-4fd9-9e3e-f58412629c9b

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.repository.ts:228:74
   async getActivitySummary(projectId: string): Promise<AssetActivitySummary> {
     const [row] = await this.db
       .select({
-        lastAddedAt: sql<string | null>`max(${assetTable.createdAt})`.as('last_added_at'),
+        lastAddedAt: sql<string | null>`max(${assetTable.createdAt})`.as(""),
         addedLast7d: sql<number>`count(*) filter (where ${assetTable.createdAt} >= now() - interval '7 days')::int`.as(
           'added_last_7d',
killedBy: DrizzleAssetRepository other repository methods (unaffected by the identity split) getActivitySummary reports null lastAddedAt and zero counts for a project with no assets
statusReason: promise rejected "Error: Failed query: select max("created_… { …(2) }" instead of resolving

[Killed] StringLiteral
infrastructure/drizzle/repository/asset.repository.ts:229:33
     const [row] = await this.db
       .select({
         lastAddedAt: sql<string | null>`max(${assetTable.createdAt})`.as('last_added_at'),
-        addedLast7d: sql<number>`count(*) filter (where ${assetTable.createdAt} >= now() - interval '7 days')::int`.as(
+        addedLast7d: sql<number>``.as(
           'added_last_7d',
         ),
killedBy: DrizzleAssetRepository other repository methods (unaffected by the identity split) getActivitySummary reports null lastAddedAt and zero counts for a project with no assets
statusReason: promise rejected "Error: Failed query: select max("created_… { …(2) }" instead of resolving
