[Killed] ArithmeticOperator
infrastructure/drizzle/repository/cluster.repository.ts:35:10
 /** Matches `similarity`'s own storage precision (see asset.hashDuplicate.schema.ts) — rounding here means
  * two requests differing only below that precision always share one cache entry instead of fragmenting it. */
 function roundThreshold(value: number): number {
-  return Math.round(value * 10) / 10;
+  return Math.round(value * 10) * 10;
 }
 
killedBy: DrizzleClusterSearchRepository paginate returns one cluster with both members and their avg similarity
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
infrastructure/drizzle/repository/cluster.repository.ts:35:21
 /** Matches `similarity`'s own storage precision (see asset.hashDuplicate.schema.ts) — rounding here means
  * two requests differing only below that precision always share one cache entry instead of fragmenting it. */
 function roundThreshold(value: number): number {
-  return Math.round(value * 10) / 10;
+  return Math.round(value / 10) / 10;
 }
 
killedBy: DrizzleClusterRepository countEdges excludes edges below the given similarity threshold
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.repository.ts:51:79
    * rows cascade automatically. A retention sweep, not an invalidation: still-within-retention rows are
    * left alone on purpose (see that constant's doc). Unconditional even on a zero-edge recompute — cheaper
    * than detecting "did anything change". */
-  async bumpGeneration(projectId: string, algorithmId: number): Promise<void> {
-    await this.db.transaction(async (tx) => {
-      await tx.execute(sql`
-        INSERT INTO cluster_generation (project_id, algorithm_id, generation)
-        VALUES (${projectId}::uuid, ${algorithmId}::integer, 1)
-        ON CONFLICT (project_id, algorithm_id)
-        DO UPDATE SET generation = cluster_generation.generation + 1
-      `);
-
-      await tx.execute(sql`
-        DELETE FROM cluster_cache_meta
-        WHERE project_id = ${projectId} AND algorithm_id = ${algorithmId}
-          AND computed_at < now() - (${CLUSTER_CACHE_RETENTION_MS}::text || ' milliseconds')::interval
-      `);
-    });
-  }
+  async bumpGeneration(projectId: string, algorithmId: number): Promise<void> {}
 
   /** Same as {@link bumpGeneration}, but for call sites that only have `assetId` (e.g. `deleteByAsset`) —
killedBy: DrizzleClusterRepository bumpGeneration / bumpGenerationForAsset starts a scope at generation 1 on first bump
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.repository.ts:52:45
    * left alone on purpose (see that constant's doc). Unconditional even on a zero-edge recompute — cheaper
    * than detecting "did anything change". */
   async bumpGeneration(projectId: string, algorithmId: number): Promise<void> {
-    await this.db.transaction(async (tx) => {
-      await tx.execute(sql`
-        INSERT INTO cluster_generation (project_id, algorithm_id, generation)
-        VALUES (${projectId}::uuid, ${algorithmId}::integer, 1)
-        ON CONFLICT (project_id, algorithm_id)
-        DO UPDATE SET generation = cluster_generation.generation + 1
-      `);
-
-      await tx.execute(sql`
-        DELETE FROM cluster_cache_meta
-        WHERE project_id = ${projectId} AND algorithm_id = ${algorithmId}
-          AND computed_at < now() - (${CLUSTER_CACHE_RETENTION_MS}::text || ' milliseconds')::interval
-      `);
-    });
+    await this.db.transaction(async (tx) => {});
   }
 
killedBy: DrizzleClusterRepository bumpGeneration / bumpGenerationForAsset starts a scope at generation 1 on first bump
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.repository.ts:53:27
    * than detecting "did anything change". */
   async bumpGeneration(projectId: string, algorithmId: number): Promise<void> {
     await this.db.transaction(async (tx) => {
-      await tx.execute(sql`
-        INSERT INTO cluster_generation (project_id, algorithm_id, generation)
-        VALUES (${projectId}::uuid, ${algorithmId}::integer, 1)
-        ON CONFLICT (project_id, algorithm_id)
-        DO UPDATE SET generation = cluster_generation.generation + 1
-      `);
+      await tx.execute(sql``);
 
       await tx.execute(sql`
killedBy: DrizzleClusterRepository bumpGeneration / bumpGenerationForAsset starts a scope at generation 1 on first bump
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.repository.ts:72:85
    * the asset row still exists at call time, so the project is derivable via a subquery. Sweeps the whole
    * derived project+algorithm, not just the touched asset, since cluster membership is a whole-graph
    * property. */
-  async bumpGenerationForAsset(algorithmId: number, assetId: string): Promise<void> {
-    await this.db.transaction(async (tx) => {
-      await tx.execute(sql`
-        INSERT INTO cluster_generation (project_id, algorithm_id, generation)
-        SELECT a.project_id, ${algorithmId}::integer, 1 FROM asset a WHERE a.id = ${assetId}::uuid
-        ON CONFLICT (project_id, algorithm_id)
-        DO UPDATE SET generation = cluster_generation.generation + 1
-      `);
-
-      await tx.execute(sql`
-        DELETE FROM cluster_cache_meta
-        WHERE algorithm_id = ${algorithmId}
-          AND project_id = (SELECT a.project_id FROM asset a WHERE a.id = ${assetId}::uuid)
-          AND computed_at < now() - (${CLUSTER_CACHE_RETENTION_MS}::text || ' milliseconds')::interval
-      `);
-    });
-  }
+  async bumpGenerationForAsset(algorithmId: number, assetId: string): Promise<void> {}
 
   async computeStats(
killedBy: DrizzleClusterRepository bumpGeneration / bumpGenerationForAsset bumpGenerationForAsset resolves the project from the asset row and bumps the same scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.repository.ts:73:45
    * derived project+algorithm, not just the touched asset, since cluster membership is a whole-graph
    * property. */
   async bumpGenerationForAsset(algorithmId: number, assetId: string): Promise<void> {
-    await this.db.transaction(async (tx) => {
-      await tx.execute(sql`
-        INSERT INTO cluster_generation (project_id, algorithm_id, generation)
-        SELECT a.project_id, ${algorithmId}::integer, 1 FROM asset a WHERE a.id = ${assetId}::uuid
-        ON CONFLICT (project_id, algorithm_id)
-        DO UPDATE SET generation = cluster_generation.generation + 1
-      `);
-
-      await tx.execute(sql`
-        DELETE FROM cluster_cache_meta
-        WHERE algorithm_id = ${algorithmId}
-          AND project_id = (SELECT a.project_id FROM asset a WHERE a.id = ${assetId}::uuid)
-          AND computed_at < now() - (${CLUSTER_CACHE_RETENTION_MS}::text || ' milliseconds')::interval
-      `);
-    });
+    await this.db.transaction(async (tx) => {});
   }
 
killedBy: DrizzleClusterRepository bumpGeneration / bumpGenerationForAsset bumpGenerationForAsset resolves the project from the asset row and bumps the same scope
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.repository.ts:81:27
         DO UPDATE SET generation = cluster_generation.generation + 1
       `);
 
-      await tx.execute(sql`
-        DELETE FROM cluster_cache_meta
-        WHERE algorithm_id = ${algorithmId}
-          AND project_id = (SELECT a.project_id FROM asset a WHERE a.id = ${assetId}::uuid)
-          AND computed_at < now() - (${CLUSTER_CACHE_RETENTION_MS}::text || ' milliseconds')::interval
-      `);
+      await tx.execute(sql``);
     });
   }
killedBy: DrizzleClusterRepository bumpGeneration / bumpGenerationForAsset bumpGenerationForAsset sweeps out cache entries past the retention window, keeping fresh ones
statusReason: expected [ 1, 2 ] to not include 1

[Killed] ConditionalExpression
infrastructure/drizzle/repository/cluster.repository.ts:100:9
     // Stryker disable next-line EqualityOperator: the >/>= boundary is only observable exactly at
     // 200,000 real edges, which isn't practical to set up in a test (200k rows) or fake convincingly
     // without stubbing out the whole transaction/insert chain.
-    if (edgeCount > MAX_CLUSTER_EDGE_COUNT) {
+    if (false) {
       return null;
     }
killedBy: DrizzleClusterRepository computeStats — over the edge-count safety cap returns null without attempting to compute clusters
statusReason: promise rejected "TypeError: this.db.transaction is not a f…" instead of resolving

[Killed] ConditionalExpression
infrastructure/drizzle/repository/cluster.repository.ts:100:9
     // Stryker disable next-line EqualityOperator: the >/>= boundary is only observable exactly at
     // 200,000 real edges, which isn't practical to set up in a test (200k rows) or fake convincingly
     // without stubbing out the whole transaction/insert chain.
-    if (edgeCount > MAX_CLUSTER_EDGE_COUNT) {
+    if (true) {
       return null;
     }
killedBy: DrizzleClusterRepository computeStats returns zeroed stats when there are no qualifying edges
statusReason: expected null to deeply equal { clusterCount: +0, …(2) }

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.repository.ts:106:108
 
     const { metaId } = await this.ensureFresh(projectId, algorithmId, minSimilarity);
 
-    const [row] = await this.db.execute<{ cluster_count: number; assets_with_duplicate_count: number }>(sql`
-      SELECT
-        COUNT(DISTINCT cluster_id)::int AS cluster_count,
-        COUNT(*)::int AS assets_with_duplicate_count
-      FROM cluster_cache_asset
-      WHERE cluster_cache_meta_id = ${metaId}
-    `);
+    const [row] = await this.db.execute<{ cluster_count: number; assets_with_duplicate_count: number }>(sql``);
 
     /* v8 ignore next 5 -- unreachable: COUNT(*) with no GROUP BY always returns exactly one row */
killedBy: DrizzleClusterRepository computeStats groups two directly-connected assets into one cluster
statusReason: expected { Object (clusterCount, edgeCount, ...) } to deeply equal { clusterCount: 1, edgeCount: 1, …(1) }

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.repository.ts:129:63
   async countEdges(projectId: string, algorithmId: number, minSimilarity: number): Promise<number> {
     const threshold = roundThreshold(minSimilarity);
 
-    const [row] = await this.db.execute<{ value: number }>(sql`
-      SELECT count(*)::int AS value
-      FROM asset_hash_duplicate d
-      JOIN asset a ON a.id = d.asset_id
-      WHERE a.project_id = ${projectId} AND d.algorithm_id = ${algorithmId}
-        AND d.similarity >= ${threshold} AND d.asset_id < d.other_asset_id
-    `);
+    const [row] = await this.db.execute<{ value: number }>(sql``);
 
     /* v8 ignore next -- unreachable: COUNT(*) with no GROUP BY always returns exactly one row */
killedBy: DrizzleClusterRepository countEdges counts each undirected pair once
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.repository.ts:149:41
   ): Promise<ResolvedClusterScope> {
     const threshold = roundThreshold(minSimilarity);
 
-    if (pinnedGeneration !== undefined) {
-      const metaId = await this.findMetaId(projectId, algorithmId, threshold, pinnedGeneration);
-
-      if (metaId === null) {
-        throw ValidationError.clusterGenerationExpired(pinnedGeneration);
-      }
-
-      return { threshold, generation: pinnedGeneration, metaId };
-    }
+    if (pinnedGeneration !== undefined) {}
 
     const currentGeneration = await this.getCurrentGeneration(projectId, algorithmId);
killedBy: DrizzleClusterRepository ensureFresh throws ValidationError when pinned to a generation that was never computed
statusReason: promise resolved "{ threshold: 90, generation: +0, …(1) }" instead of rejecting

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.repository.ts:228:27
 
       const metaId = metaRow.id;
 
-      await tx.execute(sql`
-        INSERT INTO cluster_cache_asset (asset_id, cluster_cache_meta_id, cluster_id)
-        SELECT DISTINCT d.asset_id, ${metaId}::integer, d.asset_id
-        FROM asset_hash_duplicate d
-        JOIN asset a ON a.id = d.asset_id
-        WHERE a.project_id = ${projectId} AND d.algorithm_id = ${algorithmId} AND d.similarity >= ${threshold}
-        ON CONFLICT (asset_id, cluster_cache_meta_id) DO NOTHING
-      `);
+      await tx.execute(sql``);
 
       await this.propagateLabels(tx, projectId, algorithmId, threshold, metaId);
killedBy: DrizzleClusterRepository computeStats groups two directly-connected assets into one cluster
statusReason: expected { Object (clusterCount, edgeCount, ...) } to deeply equal { clusterCount: 1, edgeCount: 1, …(1) }

[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.repository.ts:253:85
     // Stryker disable next-line AssignmentOperator,EqualityOperator: only observable once propagation needs
     // close to MAX_PROPAGATION_ITERATIONS passes — a pathological chain length already accepted as
     // impractical to construct in a test. Normal-diameter graphs exit via `changed.length === 0` first.
-    for (let iteration = 0; iteration < MAX_PROPAGATION_ITERATIONS; iteration += 1) {
-      // MIN() has no uuid aggregate in Postgres — cast to text (ordering matches uuid's own hex encoding)
-      // to aggregate, then cast back so the WHERE comparison stays uuid <-> uuid.
-      const changed = await tx.execute<{ asset_id: string }>(sql`
-        UPDATE cluster_cache_asset cs
-        SET cluster_id = sub.min_label
-        FROM (
-          SELECT cs1.asset_id AS asset_id, MIN(cs2.cluster_id::text)::uuid AS min_label
-          FROM asset_hash_duplicate d
-          JOIN asset a ON a.id = d.asset_id
-          JOIN cluster_cache_asset cs1 ON cs1.asset_id = d.asset_id AND cs1.cluster_cache_meta_id = ${metaId}
-          JOIN cluster_cache_asset cs2 ON cs2.asset_id = d.other_asset_id AND cs2.cluster_cache_meta_id = ${metaId}
-          WHERE a.project_id = ${projectId} AND d.algorithm_id = ${algorithmId} AND d.similarity >= ${threshold}
-          GROUP BY cs1.asset_id
-        ) sub
-        WHERE cs.asset_id = sub.asset_id AND cs.cluster_cache_meta_id = ${metaId}
-          AND sub.min_label < cs.cluster_id
-        RETURNING cs.asset_id
-      `);
-
-      if (changed.length === 0) {
-        return;
-      }
-    }
+    for (let iteration = 0; iteration < MAX_PROPAGATION_ITERATIONS; iteration += 1) {}
 
     /* v8 ignore next 3 -- defensive: near-duplicate graphs are small-diameter in practice, see the class doc */
killedBy: DrizzleClusterRepository bumpGeneration / bumpGenerationForAsset starts a scope at generation 1 on first bump
statusReason: cluster computation for algorithm 1 at threshold 90% did not converge — this indicates a pathologically large-diameter duplicate graph; please report this

[Killed] ConditionalExpression
infrastructure/drizzle/repository/cluster.repository.ts:253:29
     // Stryker disable next-line AssignmentOperator,EqualityOperator: only observable once propagation needs
     // close to MAX_PROPAGATION_ITERATIONS passes — a pathological chain length already accepted as
     // impractical to construct in a test. Normal-diameter graphs exit via `changed.length === 0` first.
-    for (let iteration = 0; iteration < MAX_PROPAGATION_ITERATIONS; iteration += 1) {
+    for (let iteration = 0; false; iteration += 1) {
       // MIN() has no uuid aggregate in Postgres — cast to text (ordering matches uuid's own hex encoding)
       // to aggregate, then cast back so the WHERE comparison stays uuid <-> uuid.
killedBy: DrizzleClusterSearchRepository paginate returns an empty page when there are no qualifying edges
statusReason: cluster computation for algorithm 1 at threshold 90% did not converge — this indicates a pathologically large-diameter duplicate graph; please report this

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.repository.ts:256:65
     for (let iteration = 0; iteration < MAX_PROPAGATION_ITERATIONS; iteration += 1) {
       // MIN() has no uuid aggregate in Postgres — cast to text (ordering matches uuid's own hex encoding)
       // to aggregate, then cast back so the WHERE comparison stays uuid <-> uuid.
-      const changed = await tx.execute<{ asset_id: string }>(sql`
-        UPDATE cluster_cache_asset cs
-        SET cluster_id = sub.min_label
-        FROM (
-          SELECT cs1.asset_id AS asset_id, MIN(cs2.cluster_id::text)::uuid AS min_label
-          FROM asset_hash_duplicate d
-          JOIN asset a ON a.id = d.asset_id
-          JOIN cluster_cache_asset cs1 ON cs1.asset_id = d.asset_id AND cs1.cluster_cache_meta_id = ${metaId}
-          JOIN cluster_cache_asset cs2 ON cs2.asset_id = d.other_asset_id AND cs2.cluster_cache_meta_id = ${metaId}
-          WHERE a.project_id = ${projectId} AND d.algorithm_id = ${algorithmId} AND d.similarity >= ${threshold}
-          GROUP BY cs1.asset_id
-        ) sub
-        WHERE cs.asset_id = sub.asset_id AND cs.cluster_cache_meta_id = ${metaId}
-          AND sub.min_label < cs.cluster_id
-        RETURNING cs.asset_id
-      `);
+      const changed = await tx.execute<{ asset_id: string }>(sql``);
 
       if (changed.length === 0) {
killedBy: DrizzleClusterRepository computeStats groups two directly-connected assets into one cluster
statusReason: expected { clusterCount: 2, edgeCount: 1, …(1) } to deeply equal { clusterCount: 1, edgeCount: 1, …(1) }

[Killed] ConditionalExpression
infrastructure/drizzle/repository/cluster.repository.ts:273:11
         RETURNING cs.asset_id
       `);
 
-      if (changed.length === 0) {
+      if (false) {
         return;
       }
killedBy: DrizzleClusterSearchRepository paginate returns an empty page when there are no qualifying edges
statusReason: cluster computation for algorithm 1 at threshold 90% did not converge — this indicates a pathologically large-diameter duplicate graph; please report this

[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.repository.ts:273:33
         RETURNING cs.asset_id
       `);
 
-      if (changed.length === 0) {
-        return;
-      }
+      if (changed.length === 0) {}
     }
 
killedBy: DrizzleClusterRepository bumpGeneration / bumpGenerationForAsset starts a scope at generation 1 on first bump
statusReason: cluster computation for algorithm 1 at threshold 90% did not converge — this indicates a pathologically large-diameter duplicate graph; please report this
