[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.search.repository.ts:51:45
 
     // Stryker disable next-line EqualityOperator: same rationale as cluster.repository.ts — only
     // observable exactly at 200,000 real edges, impractical to set up in a test.
-    if (edgeCount > MAX_CLUSTER_EDGE_COUNT) {
-      throw ValidationError.tooManyDuplicateEdges(edgeCount);
-    }
+    if (edgeCount > MAX_CLUSTER_EDGE_COUNT) {}
 
     // ensureFresh both resolves (recomputing if stale) which snapshot to read AND hands back its
killedBy: DrizzleClusterSearchRepository paginate throws ValidationError.tooManyDuplicateEdges when the edge count exceeds the safety cap
statusReason: expected error to be instance of ValidationError

[Killed] ConditionalExpression
infrastructure/drizzle/repository/cluster.search.repository.ts:51:9
 
     // Stryker disable next-line EqualityOperator: same rationale as cluster.repository.ts — only
     // observable exactly at 200,000 real edges, impractical to set up in a test.
-    if (edgeCount > MAX_CLUSTER_EDGE_COUNT) {
+    if (false) {
       throw ValidationError.tooManyDuplicateEdges(edgeCount);
     }
killedBy: DrizzleClusterSearchRepository paginate throws ValidationError.tooManyDuplicateEdges when the edge count exceeds the safety cap
statusReason: expected error to be instance of ValidationError

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.search.repository.ts:121:39
     return new DrizzleSimpleAdapter(
       () =>
         this.db
-          .select({ count: sql<number>`count(distinct ${clusterCacheAssetTable.clusterId})::int`.as('count') })
+          .select({ count: sql<number>``.as('count') })
           .from(clusterCacheAssetTable)
           .$dynamic()
killedBy: DrizzleClusterSearchRepository paginate returns an empty page when there are no qualifying edges
statusReason: Failed query: select  as "count" from "cluster_cache_asset" where "cluster_cache_asset"."cluster_cache_meta_id" = $1
params: 1

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.search.repository.ts:130:87
         this.db
           .select({
             clusterId: clusterCacheAssetTable.clusterId,
-            maxSimilarity: sql<number>`max(${assetHashDuplicateTable.similarity})`.as('max_similarity'),
+            maxSimilarity: sql<number>`max(${assetHashDuplicateTable.similarity})`.as(""),
           })
           .from(clusterCacheAssetTable)
killedBy: DrizzleClusterSearchRepository paginate returns an empty page when there are no qualifying edges
statusReason: params: 90,1,10

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.search.repository.ts:143:23
           .$dynamic()
           .where(scope)
           .groupBy(clusterCacheAssetTable.clusterId)
-          .orderBy(sql`max_similarity desc`, clusterCacheAssetTable.clusterId),
+          .orderBy(sql``, clusterCacheAssetTable.clusterId),
     );
   }
killedBy: DrizzleClusterSearchRepository paginate returns an empty page when there are no qualifying edges
statusReason: params: 90,1,10

[Killed] StringLiteral
infrastructure/drizzle/repository/cluster.search.repository.ts:170:35
         clusterId: clusterCacheAssetTable.clusterId,
         identityId: assetTable.identityId,
         identityPath: assetTable.identityPath,
-        avgSimilarity: sql<number>`avg(${assetHashDuplicateTable.similarity})`.as('avg_similarity'),
+        avgSimilarity: sql<number>``.as('avg_similarity'),
       })
       .from(clusterCacheAssetTable)
killedBy: DrizzleClusterSearchRepository paginate returns one cluster with both members and their avg similarity
statusReason: params: 90,1,203b8afd-6b6a-46e8-bb8e-c6116067a421

[Killed] BlockStatement
infrastructure/drizzle/repository/cluster.search.repository.ts:192:29
       // on createRankingAdapter in asset.hashDuplicate.search.repository.ts).
       .groupBy(clusterCacheAssetTable.clusterId, assetTable.id);
 
-    for (const row of rows) {
-      const list = membersByCluster.get(row.clusterId) ?? [];
-      list.push({
-        identity: new Identity(row.identityId, row.identityPath),
-        avgSimilarityToCluster: Math.round(row.avgSimilarity * 10) / 10,
-      });
-      membersByCluster.set(row.clusterId, list);
-    }
+    for (const row of rows) {}
 
     return membersByCluster;
killedBy: DrizzleClusterSearchRepository paginate returns one cluster with both members and their avg similarity
statusReason: expected [] to deeply equal ArrayContaining{…}

[Killed] ArithmeticOperator
infrastructure/drizzle/repository/cluster.search.repository.ts:196:33
       const list = membersByCluster.get(row.clusterId) ?? [];
       list.push({
         identity: new Identity(row.identityId, row.identityPath),
-        avgSimilarityToCluster: Math.round(row.avgSimilarity * 10) / 10,
+        avgSimilarityToCluster: Math.round(row.avgSimilarity * 10) * 10,
       });
       membersByCluster.set(row.clusterId, list);
killedBy: DrizzleClusterSearchRepository paginate returns one cluster with both members and their avg similarity
statusReason: expected [ { …(2) }, { …(2) } ] to deeply equal ArrayContaining{…}

[Killed] ArithmeticOperator
infrastructure/drizzle/repository/cluster.search.repository.ts:196:44
       const list = membersByCluster.get(row.clusterId) ?? [];
       list.push({
         identity: new Identity(row.identityId, row.identityPath),
-        avgSimilarityToCluster: Math.round(row.avgSimilarity * 10) / 10,
+        avgSimilarityToCluster: Math.round(row.avgSimilarity / 10) / 10,
       });
       membersByCluster.set(row.clusterId, list);
killedBy: DrizzleClusterSearchRepository paginate returns one cluster with both members and their avg similarity
statusReason: expected [ { …(2) }, { …(2) } ] to deeply equal ArrayContaining{…}

[Killed] CallExpression
infrastructure/drizzle/repository/cluster.search.repository.ts:198:7
         identity: new Identity(row.identityId, row.identityPath),
         avgSimilarityToCluster: Math.round(row.avgSimilarity * 10) / 10,
       });
-      membersByCluster.set(row.clusterId, list);
+      ;
     }
 
killedBy: DrizzleClusterSearchRepository paginate returns one cluster with both members and their avg similarity
statusReason: expected [] to deeply equal ArrayContaining{…}
