[Killed] ConditionalExpression
infrastructure/drizzle/repository/project.repository.ts:59:11
 
       return row;
     } catch (err) {
-      if (isUniqueError(err)) {
+      if (false) {
         throw AlreadyExistsError.project(params.slug);
       }
killedBy: DrizzleProjectRepository rejects creating a project with a duplicate slug as AlreadyExistsError
statusReason: expected error to be instance of AlreadyExistsError

[Killed] ObjectLiteral
infrastructure/drizzle/repository/project.repository.ts:70:12
   async updateSettings(id: string, update: ProjectSettingsUpdate): Promise<Project> {
     const [row] = await this.db
       .update(projectTable)
-      .set({
-        // Stryker disable all: drizzle-orm's own `.set()` already drops `undefined`-valued keys before
-        // building the SQL, so forcing these spreads to always include the key (even as `undefined`)
-        // produces byte-identical SQL to the guarded version — there's no observable difference to assert
-        // on. The guards stay for readability/intent, not correctness.
-        ...(update.name !== undefined && { name: update.name }),
-        ...(update.recipes !== undefined && { recipes: update.recipes }),
-        ...(update.hammingThreshold !== undefined && { hammingThreshold: update.hammingThreshold }),
-        ...(update.rateLimitPerMinute !== undefined && { rateLimitPerMinute: update.rateLimitPerMinute }),
-        // Stryker restore all
-        updatedAt: new Date(),
-      })
+      .set({})
       .where(eq(projectTable.id, id))
       .returning();
killedBy: DrizzleProjectRepository updateSettings updates recipes and hammingThreshold
statusReason: No values to set

[Killed] BlockStatement
infrastructure/drizzle/repository/project.repository.ts:92:47
     return row;
   }
 
-  async deleteById(id: string): Promise<void> {
-    await this.db.delete(projectTable).where(eq(projectTable.id, id));
-  }
+  async deleteById(id: string): Promise<void> {}
 }
 
killedBy: DrizzleProjectRepository deleteById removes the project (idempotent on repeat)
statusReason: expected { …(8) } to be null
