[Killed] ConditionalExpression
src/infrastructure/rateLimit/projectRateLimitCache.ts:34:33
     const now = Date.now();
     const cached = this.entries.get(projectId);
 
-    if (cached !== undefined && cached.expiresAt > now) {
+    if (cached !== undefined && true) {
       return cached.value;
     }
killedBy: ProjectRateLimitCache re-queries once the TTL has expired
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] EqualityOperator
src/infrastructure/rateLimit/projectRateLimitCache.ts:34:33
     const now = Date.now();
     const cached = this.entries.get(projectId);
 
-    if (cached !== undefined && cached.expiresAt > now) {
+    if (cached !== undefined && cached.expiresAt <= now) {
       return cached.value;
     }
killedBy: ProjectRateLimitCache does not re-query on a second call within the TTL
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ArithmeticOperator
src/infrastructure/rateLimit/projectRateLimitCache.ts:41:53
     const project = await this.projects.findById(projectId);
     const value = project?.rateLimitPerMinute ?? this.defaultRateLimitPerMinute;
 
-    this.entries.set(projectId, { value, expiresAt: now + this.ttlMs });
+    this.entries.set(projectId, { value, expiresAt: now - this.ttlMs });
 
     return value;
killedBy: ProjectRateLimitCache does not re-query on a second call within the TTL
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/infrastructure/rateLimit/projectRateLimitCache.ts:46:39
     return value;
   }
 
-  invalidate(projectId: string): void {
-    this.entries.delete(projectId);
-  }
+  invalidate(projectId: string): void {}
 }
 
killedBy: ProjectRateLimitCache invalidate() forces the next resolve() to re-query
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] CallExpression
src/infrastructure/rateLimit/projectRateLimitCache.ts:47:5
   }
 
   invalidate(projectId: string): void {
-    this.entries.delete(projectId);
+    ;
   }
 }
killedBy: ProjectRateLimitCache invalidate() forces the next resolve() to re-query
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times
