[Killed] ConditionalExpression
src/infrastructure/config/config.ts:46:35
 export function resolveConfigPath(): string {
   const configPath = process.env.CONFIG_PATH;
 
-  if (configPath === undefined || configPath.length === 0) {
+  if (configPath === undefined || false) {
     throw ConfigError.missingConfigPathEnv();
   }
killedBy: resolveConfigPath throws when CONFIG_PATH is empty
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/infrastructure/config/config.ts:46:35
 export function resolveConfigPath(): string {
   const configPath = process.env.CONFIG_PATH;
 
-  if (configPath === undefined || configPath.length === 0) {
+  if (configPath === undefined || configPath.length !== 0) {
     throw ConfigError.missingConfigPathEnv();
   }
killedBy: resolveConfigPath returns CONFIG_PATH when set
statusReason: CONFIG_PATH environment variable must be set

[Killed] EqualityOperator
src/infrastructure/config/config.ts:56:28
 export function resolveDatabaseConfig(config: Config): DatabaseConfig {
   const url = process.env.DATABASE_URL;
 
-  if (url === undefined || url.length === 0) {
+  if (url === undefined || url.length !== 0) {
     throw ConfigError.missingDatabaseUrlEnv();
   }
killedBy: buildContainer wires the full CQRS chain end to end: create a project via the real container
statusReason: DATABASE_URL environment variable must be set

[Killed] ConditionalExpression
src/infrastructure/config/config.ts:56:28
 export function resolveDatabaseConfig(config: Config): DatabaseConfig {
   const url = process.env.DATABASE_URL;
 
-  if (url === undefined || url.length === 0) {
+  if (url === undefined || false) {
     throw ConfigError.missingDatabaseUrlEnv();
   }
killedBy: resolveDatabaseConfig throws when DATABASE_URL is empty
statusReason: expected function to throw an error, but it didn't
