[Killed] ArithmeticOperator
src/infrastructure/core/coreClient.ts:48:53
   constructor(
     private readonly baseUrl: string,
     private readonly timeoutMs: number,
-    private readonly algorithmsCacheTtlMs: number = 5 * 60_000,
+    private readonly algorithmsCacheTtlMs: number = 5 / 60_000,
   ) {}
 
killedBy: CoreClient.listAlgorithms defaults the cache TTL to several minutes — an immediate second call still hits the cache
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ObjectLiteral
src/infrastructure/core/coreClient.ts:56:20
     const body = await this.request<CoreHashResponseBody>('/hash', {
       method: 'POST',
       body: JSON.stringify({
-        mime_hint: { type: mimeHint.type, value: mimeHint.value },
+        mime_hint: {},
         file_content: fileContentBase64,
         recipes,
killedBy: CoreClient.hash returns normalized results and sends mime_hint/file_content/recipes in the body
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://core:3000/hash', …(1) ]

Received:

  1st vi.fn() call:

  [
    "http://core:3000/hash",

[Killed] ConditionalExpression
src/infrastructure/core/coreClient.ts:62:26
       }),
     });
 
-    if (!body.results || body.results.length === 0) {
+    if (!body.results || false) {
       throw CoreUnavailableError.emptyHashResponse();
     }
killedBy: CoreClient.hash throws CoreUnavailableError when results is empty
statusReason: promise resolved "[]" instead of rejecting

[Killed] EqualityOperator
src/infrastructure/core/coreClient.ts:62:26
       }),
     });
 
-    if (!body.results || body.results.length === 0) {
+    if (!body.results || body.results.length !== 0) {
       throw CoreUnavailableError.emptyHashResponse();
     }
killedBy: CoreClient.hash returns normalized results and sends mime_hint/file_content/recipes in the body
statusReason: core returned an empty /hash response

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:70:78
   }
 
   async listAlgorithms(): Promise<CoreAlgorithm[]> {
-    if (this.algorithmsCache && this.algorithmsCache.expiresAt > Date.now()) {
-      return this.algorithmsCache.value;
-    }
+    if (this.algorithmsCache && this.algorithmsCache.expiresAt > Date.now()) {}
 
     if (this.algorithmsPending) {
killedBy: CoreClient.listAlgorithms caches the result within the TTL — a second call does not refetch
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] EqualityOperator
src/infrastructure/core/coreClient.ts:70:33
   }
 
   async listAlgorithms(): Promise<CoreAlgorithm[]> {
-    if (this.algorithmsCache && this.algorithmsCache.expiresAt > Date.now()) {
+    if (this.algorithmsCache && this.algorithmsCache.expiresAt <= Date.now()) {
       return this.algorithmsCache.value;
     }
killedBy: CoreClient.listAlgorithms caches the result within the TTL — a second call does not refetch
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:74:33
       return this.algorithmsCache.value;
     }
 
-    if (this.algorithmsPending) {
-      return this.algorithmsPending;
-    }
+    if (this.algorithmsPending) {}
 
     const promise = this.fetchAlgorithms()
killedBy: CoreClient.listAlgorithms coalesces concurrent in-flight calls into a single fetch
statusReason: Test timed out in 10000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArithmeticOperator
src/infrastructure/core/coreClient.ts:80:52
 
     const promise = this.fetchAlgorithms()
       .then((value) => {
-        this.algorithmsCache = { value, expiresAt: Date.now() + this.algorithmsCacheTtlMs };
+        this.algorithmsCache = { value, expiresAt: Date.now() - this.algorithmsCacheTtlMs };
 
         return value;
killedBy: CoreClient.listAlgorithms caches the result within the TTL — a second call does not refetch
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:84:22
 
         return value;
       })
-      .finally(() => {
-        this.algorithmsPending = null;
-      });
+      .finally(() => {});
 
     this.algorithmsPending = promise;
killedBy: CoreClient.listAlgorithms refetches after the cache TTL expires
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] ConditionalExpression
src/infrastructure/core/coreClient.ts:94:9
   }
 
   private normalizeHashResult(result: CoreHashResultWire): CoreHashResult {
-    if (result.vectors !== undefined) {
+    if (false) {
       throw UnsupportedRecipeError.vectorRecipe(result.recipe);
     }
killedBy: CoreClient.hash throws UnsupportedRecipeError when a result returns vectors
statusReason: expected error to be instance of UnsupportedRecipeError

[Killed] EqualityOperator
src/infrastructure/core/coreClient.ts:94:9
   }
 
   private normalizeHashResult(result: CoreHashResultWire): CoreHashResult {
-    if (result.vectors !== undefined) {
+    if (result.vectors === undefined) {
       throw UnsupportedRecipeError.vectorRecipe(result.recipe);
     }
killedBy: CoreClient.hash returns normalized results and sends mime_hint/file_content/recipes in the body
statusReason: recipe 'binary.sha256' returned vectors — cosine/vector recipes aren't implemented in registry yet

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:97:38
     if (result.vectors !== undefined) {
       throw UnsupportedRecipeError.vectorRecipe(result.recipe);
     }
-    if (result.hashes !== undefined) {
-      return { recipe: result.recipe, hashes: result.hashes };
-    }
+    if (result.hashes !== undefined) {}
 
     throw CoreUnavailableError.malformedHashResult(result.recipe);
killedBy: CoreClient.hash returns normalized results and sends mime_hint/file_content/recipes in the body
statusReason: core /hash result for recipe 'binary.sha256' has neither 'hashes' nor 'vectors'

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:116:36
 
   private async request<T>(path: string, init: { method: string; body?: string }): Promise<T> {
     const controller = new AbortController();
-    const timer = setTimeout(() => {
-      controller.abort();
-    }, this.timeoutMs);
+    const timer = setTimeout(() => {}, this.timeoutMs);
 
     try {
killedBy: CoreClient.hash aborts and reports unavailability once the request exceeds the timeout
statusReason: Test timed out in 10000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] CallExpression
src/infrastructure/core/coreClient.ts:117:7
   private async request<T>(path: string, init: { method: string; body?: string }): Promise<T> {
     const controller = new AbortController();
     const timer = setTimeout(() => {
-      controller.abort();
+      ;
     }, this.timeoutMs);
 
killedBy: CoreClient.hash aborts and reports unavailability once the request exceeds the timeout
statusReason: Test timed out in 10000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/infrastructure/core/coreClient.ts:121:36
     }, this.timeoutMs);
 
     try {
-      const response = await fetch(`${this.baseUrl}${path}`, {
+      const response = await fetch(``, {
         method: init.method,
         ...(init.body !== undefined && { headers: { 'content-type': 'application/json' }, body: init.body }),
killedBy: CoreClient.hash returns normalized results and sends mime_hint/file_content/recipes in the body
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://core:3000/hash', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "http://core:3000/hash",

[Killed] EqualityOperator
src/infrastructure/core/coreClient.ts:123:13
     try {
       const response = await fetch(`${this.baseUrl}${path}`, {
         method: init.method,
-        ...(init.body !== undefined && { headers: { 'content-type': 'application/json' }, body: init.body }),
+        ...(init.body === undefined && { headers: { 'content-type': 'application/json' }, body: init.body }),
         signal: controller.signal,
       });
killedBy: CoreClient.hash returns normalized results and sends mime_hint/file_content/recipes in the body
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://core:3000/hash', …(1) ]

Received:

  1st vi.fn() call:

  [
    "http://core:3000/hash",

[Killed] StringLiteral
src/infrastructure/core/coreClient.ts:123:69
     try {
       const response = await fetch(`${this.baseUrl}${path}`, {
         method: init.method,
-        ...(init.body !== undefined && { headers: { 'content-type': 'application/json' }, body: init.body }),
+        ...(init.body !== undefined && { headers: { 'content-type': "" }, body: init.body }),
         signal: controller.signal,
       });
killedBy: CoreClient.hash returns normalized results and sends mime_hint/file_content/recipes in the body
statusReason: expected "vi.fn()" to be called with arguments: [ 'http://core:3000/hash', …(1) ]

Received:

  1st vi.fn() call:

  [
    "http://core:3000/hash",

[Killed] LogicalOperator
src/infrastructure/core/coreClient.ts:134:9
       return (await response.json()) as T;
     } catch (err) {
       if (
-        err instanceof CoreUnavailableError ||
-        err instanceof AssetProcessingError ||
+        err instanceof CoreUnavailableError && err instanceof AssetProcessingError ||
         err instanceof ValidationError ||
         err instanceof UnsupportedRecipeError
killedBy: CoreClient.hash throws AssetProcessingError on a 422 response
statusReason: expected error to be instance of AssetProcessingError

[Killed] LogicalOperator
src/infrastructure/core/coreClient.ts:134:9
       return (await response.json()) as T;
     } catch (err) {
       if (
-        err instanceof CoreUnavailableError ||
-        err instanceof AssetProcessingError ||
-        err instanceof ValidationError ||
+        (err instanceof CoreUnavailableError || err instanceof AssetProcessingError) && err instanceof ValidationError ||
         err instanceof UnsupportedRecipeError
       ) {
killedBy: CoreClient.hash throws AssetProcessingError on a 422 response
statusReason: expected error to be instance of AssetProcessingError

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:138:9
         err instanceof AssetProcessingError ||
         err instanceof ValidationError ||
         err instanceof UnsupportedRecipeError
-      ) {
-        throw err;
-      }
+      ) {}
       const message = err instanceof Error ? err.message : String(err);
       throw CoreUnavailableError.unreachable(message);
killedBy: CoreClient.hash throws AssetProcessingError on a 422 response
statusReason: expected error to be instance of AssetProcessingError

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:143:15
       }
       const message = err instanceof Error ? err.message : String(err);
       throw CoreUnavailableError.unreachable(message);
-    } finally {
-      clearTimeout(timer);
-    }
+    } finally {}
   }
 
killedBy: CoreClient.hash clears the abort timer once the request settles (success path)
statusReason: expected "clearTimeout" to be called 1 times, but got 0 times

[Killed] CallExpression
src/infrastructure/core/coreClient.ts:144:7
       const message = err instanceof Error ? err.message : String(err);
       throw CoreUnavailableError.unreachable(message);
     } finally {
-      clearTimeout(timer);
+      ;
     }
   }
killedBy: CoreClient.hash clears the abort timer once the request settles (success path)
statusReason: expected "clearTimeout" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/infrastructure/core/coreClient.ts:154:9
 
     // 422: core rejected this specific asset (corrupt file, subservice item error) — fail-closed,
     // distinct from "core is unreachable" (502) since it's not a transient/infra problem.
-    if (response.status === 422) {
+    if (false) {
       throw AssetProcessingError.fromCore(message);
     }
killedBy: CoreClient.hash throws AssetProcessingError on a 422 response
statusReason: expected error to be instance of AssetProcessingError

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:154:34
 
     // 422: core rejected this specific asset (corrupt file, subservice item error) — fail-closed,
     // distinct from "core is unreachable" (502) since it's not a transient/infra problem.
-    if (response.status === 422) {
-      throw AssetProcessingError.fromCore(message);
-    }
+    if (response.status === 422) {}
     // 400: our own request was malformed (e.g. an unknown recipe, or mime_hint contradicting the
     // sniffed content), surfaced as a ValidationError rather than swallowed into a generic 502.
killedBy: CoreClient.hash throws AssetProcessingError on a 422 response
statusReason: expected error to be instance of AssetProcessingError

[Killed] ConditionalExpression
src/infrastructure/core/coreClient.ts:159:9
     }
     // 400: our own request was malformed (e.g. an unknown recipe, or mime_hint contradicting the
     // sniffed content), surfaced as a ValidationError rather than swallowed into a generic 502.
-    if (response.status === 400) {
+    if (true) {
       throw ValidationError.fromCore(message);
     }
killedBy: CoreClient.hash throws CoreUnavailableError on any other non-ok status
statusReason: expected error to be instance of CoreUnavailableError

[Killed] BlockStatement
src/infrastructure/core/coreClient.ts:159:34
     }
     // 400: our own request was malformed (e.g. an unknown recipe, or mime_hint contradicting the
     // sniffed content), surfaced as a ValidationError rather than swallowed into a generic 502.
-    if (response.status === 400) {
-      throw ValidationError.fromCore(message);
-    }
+    if (response.status === 400) {}
 
     throw CoreUnavailableError.fromCoreResponse(message);
killedBy: CoreClient.hash throws ValidationError on a 400 response
statusReason: expected error to be instance of ValidationError
