[Timeout] BlockStatement
infrastructure/drizzle/repository/algorithm.repository.ts:28:14
   async add(params: NewAlgorithmParams): Promise<Algorithm> {
     const [row] = await this.db.insert(algorithmTable).values(params).onConflictDoNothing().returning();
 
-    if (row) {
-      return row;
-    }
+    if (row) {}
 
     const existing = await this.findByRecipe(params.recipe);
