[Killed] BlockStatement
infrastructure/drizzle/repository/asset.hash.repository.ts:69:91
     };
   }
 
-  async replaceAll(assetId: string, algorithmId: number, hashes: string[]): Promise<void> {
-    await this.db.transaction(async (tx) => {
-      await tx
-        .delete(assetHashTable)
-        .where(and(eq(assetHashTable.assetId, assetId), eq(assetHashTable.algorithmId, algorithmId)));
-
-      if (hashes.length === 0) {
-        return;
-      }
-
-      await tx.insert(assetHashTable).values(
-        hashes.map((hash, sequenceIndex) => ({
-          assetId,
-          algorithmId,
-          sequenceIndex,
-          hash,
-        })),
-      );
-    });
-  }
+  async replaceAll(assetId: string, algorithmId: number, hashes: string[]): Promise<void> {}
 }
 
killedBy: DrizzleClusterRepository countEdges counts each undirected pair once
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.hash.repository.ts:70:45
   }
 
   async replaceAll(assetId: string, algorithmId: number, hashes: string[]): Promise<void> {
-    await this.db.transaction(async (tx) => {
-      await tx
-        .delete(assetHashTable)
-        .where(and(eq(assetHashTable.assetId, assetId), eq(assetHashTable.algorithmId, algorithmId)));
-
-      if (hashes.length === 0) {
-        return;
-      }
-
-      await tx.insert(assetHashTable).values(
-        hashes.map((hash, sequenceIndex) => ({
-          assetId,
-          algorithmId,
-          sequenceIndex,
-          hash,
-        })),
-      );
-    });
+    await this.db.transaction(async (tx) => {});
   }
 }
killedBy: DrizzleAssetHashDuplicateSearchRepository paginate counts and ranks assets by duplicate count, descending, tie-broken by identity
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ConditionalExpression
infrastructure/drizzle/repository/asset.hash.repository.ts:75:11
         .delete(assetHashTable)
         .where(and(eq(assetHashTable.assetId, assetId), eq(assetHashTable.algorithmId, algorithmId)));
 
-      if (hashes.length === 0) {
+      if (true) {
         return;
       }
killedBy: DrizzleClusterRepository countEdges counts each undirected pair once
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
infrastructure/drizzle/repository/asset.hash.repository.ts:75:32
         .delete(assetHashTable)
         .where(and(eq(assetHashTable.assetId, assetId), eq(assetHashTable.algorithmId, algorithmId)));
 
-      if (hashes.length === 0) {
-        return;
-      }
+      if (hashes.length === 0) {}
 
       await tx.insert(assetHashTable).values(
killedBy: DrizzleAssetHashRepository replaceAll with an empty array clears existing hashes
statusReason: values() must be called with at least one value
