[Killed] ArithmeticOperator
src/application/service/algorithm.service.ts:40:43
     private readonly algorithms: Algorithms,
     private readonly algorithmWriter: AlgorithmWriter,
     private readonly coreHasher: CoreHasher,
-    private readonly cacheTtlMs: number = 5 * 60_000,
+    private readonly cacheTtlMs: number = 5 / 60_000,
   ) {}
 
killedBy: AlgorithmService.resolveAlgorithm caches a resolved algorithm — a second call for the same recipe does not re-resolve
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/application/service/algorithm.service.ts:46:50
   async resolveAlgorithm(recipe: string): Promise<Algorithm> {
     const cached = this.cache.get(recipe);
 
-    if (cached && cached.expiresAt > Date.now()) {
-      return cached.algorithm;
-    }
+    if (cached && cached.expiresAt > Date.now()) {}
 
     const inFlight = this.pending.get(recipe);
killedBy: AlgorithmService.resolveAlgorithm caches a resolved algorithm — a second call for the same recipe does not re-resolve
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] EqualityOperator
src/application/service/algorithm.service.ts:46:19
   async resolveAlgorithm(recipe: string): Promise<Algorithm> {
     const cached = this.cache.get(recipe);
 
-    if (cached && cached.expiresAt > Date.now()) {
+    if (cached && cached.expiresAt <= Date.now()) {
       return cached.algorithm;
     }
killedBy: AlgorithmService.resolveAlgorithm caches a resolved algorithm — a second call for the same recipe does not re-resolve
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/application/service/algorithm.service.ts:52:19
 
     const inFlight = this.pending.get(recipe);
 
-    if (inFlight) {
-      return inFlight;
-    }
+    if (inFlight) {}
 
     const promise = this.resolveUncached(recipe)
killedBy: AlgorithmService.resolveAlgorithm coalesces concurrent in-flight calls for the same recipe into one resolution
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ArithmeticOperator
src/application/service/algorithm.service.ts:58:56
 
     const promise = this.resolveUncached(recipe)
       .then((algorithm) => {
-        this.cache.set(recipe, { algorithm, expiresAt: Date.now() + this.cacheTtlMs });
+        this.cache.set(recipe, { algorithm, expiresAt: Date.now() - this.cacheTtlMs });
 
         return algorithm;
killedBy: AlgorithmService.resolveAlgorithm caches a resolved algorithm — a second call for the same recipe does not re-resolve
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/application/service/algorithm.service.ts:62:22
 
         return algorithm;
       })
-      .finally(() => {
-        this.pending.delete(recipe);
-      });
+      .finally(() => {});
 
     this.pending.set(recipe, promise);
killedBy: AlgorithmService.resolveAlgorithm expires the per-recipe cache after the given TTL — a later call re-resolves
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] CallExpression
src/application/service/algorithm.service.ts:63:9
         return algorithm;
       })
       .finally(() => {
-        this.pending.delete(recipe);
+        ;
       });
 
killedBy: AlgorithmService.resolveAlgorithm expires the per-recipe cache after the given TTL — a later call re-resolves
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] CallExpression
src/application/service/algorithm.service.ts:66:5
         this.pending.delete(recipe);
       });
 
-    this.pending.set(recipe, promise);
+    ;
 
     return promise;
killedBy: AlgorithmService.resolveAlgorithm coalesces concurrent in-flight calls for the same recipe into one resolution
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/application/service/algorithm.service.ts:74:62
   private async resolveUncached(recipe: string): Promise<Algorithm> {
     const existing = await this.algorithms.findByRecipe(recipe);
     const coreAlgorithms = await this.listCoreAlgorithms();
-    const coreAlgorithm = coreAlgorithms.find((algorithm) => algorithm.recipe === recipe);
+    const coreAlgorithm = coreAlgorithms.find((algorithm) => true);
 
     if (!coreAlgorithm) {
killedBy: AlgorithmService.resolveAlgorithm matches the requested recipe among several core algorithms, not just the first in the list
statusReason: expected "vi.fn()" to be called with arguments: [ { recipe: 'image.phash16', …(1) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ArrowFunction
src/application/service/algorithm.service.ts:74:47
   private async resolveUncached(recipe: string): Promise<Algorithm> {
     const existing = await this.algorithms.findByRecipe(recipe);
     const coreAlgorithms = await this.listCoreAlgorithms();
-    const coreAlgorithm = coreAlgorithms.find((algorithm) => algorithm.recipe === recipe);
+    const coreAlgorithm = coreAlgorithms.find(() => undefined);
 
     if (!coreAlgorithm) {
killedBy: AlgorithmService.resolveAlgorithm creates a new algorithm via the writer when none exists yet
statusReason: core does not report a recipe named 'image.phash16' via GET /algorithms

[Killed] BlockStatement
src/application/service/algorithm.service.ts:80:19
       throw AlgorithmContractError.recipeNotReportedByCore(recipe);
     }
 
-    if (existing) {
-      if (existing.comparison !== coreAlgorithm.comparison) {
-        throw AlgorithmContractError.comparisonMismatch(recipe, coreAlgorithm.comparison, existing.comparison);
-      }
-
-      return existing;
-    }
+    if (existing) {}
 
     return this.algorithmWriter.add({ recipe, comparison: coreAlgorithm.comparison });
killedBy: AlgorithmService.resolveAlgorithm returns the existing algorithm when its stored comparison matches core
statusReason: expected { Object (id, recipe, ...) } to deeply equal { Object (id, recipe, ...) }

[Killed] EqualityOperator
src/application/service/algorithm.service.ts:81:11
     }
 
     if (existing) {
-      if (existing.comparison !== coreAlgorithm.comparison) {
+      if (existing.comparison === coreAlgorithm.comparison) {
         throw AlgorithmContractError.comparisonMismatch(recipe, coreAlgorithm.comparison, existing.comparison);
       }
killedBy: AlgorithmService.resolveAlgorithm returns the existing algorithm when its stored comparison matches core
statusReason: core now reports recipe 'binary.sha256' as comparison=exact, but it is already stored as comparison=exact

[Killed] BlockStatement
src/application/service/algorithm.service.ts:81:61
     }
 
     if (existing) {
-      if (existing.comparison !== coreAlgorithm.comparison) {
-        throw AlgorithmContractError.comparisonMismatch(recipe, coreAlgorithm.comparison, existing.comparison);
-      }
+      if (existing.comparison !== coreAlgorithm.comparison) {}
 
       return existing;
killedBy: AlgorithmService.resolveAlgorithm throws AlgorithmContractError when the stored comparison contradicts core
statusReason: promise resolved "{ id: 1, recipe: 'binary.sha256', …(1) }" instead of rejecting

[Killed] EqualityOperator
src/application/service/algorithm.service.ts:94:31
   /** Same cache/in-flight-coalescing shape as `resolveAlgorithm` above, just keyed on nothing (one list,
    * not one per recipe) since there's only ever one `listAlgorithms()` result to share. */
   private async listCoreAlgorithms(): Promise<CoreAlgorithm[]> {
-    if (this.coreListCache && this.coreListCache.expiresAt > Date.now()) {
+    if (this.coreListCache && this.coreListCache.expiresAt <= Date.now()) {
       return this.coreListCache.algorithms;
     }
killedBy: AlgorithmService.resolveAlgorithm reuses the core-list cache across different recipes resolved one after another
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/application/service/algorithm.service.ts:94:31
   /** Same cache/in-flight-coalescing shape as `resolveAlgorithm` above, just keyed on nothing (one list,
    * not one per recipe) since there's only ever one `listAlgorithms()` result to share. */
   private async listCoreAlgorithms(): Promise<CoreAlgorithm[]> {
-    if (this.coreListCache && this.coreListCache.expiresAt > Date.now()) {
+    if (this.coreListCache && true) {
       return this.coreListCache.algorithms;
     }
killedBy: AlgorithmService.resolveAlgorithm expires the core-list cache after the given TTL — a later call re-fetches from core
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times

[Killed] BlockStatement
src/application/service/algorithm.service.ts:98:31
       return this.coreListCache.algorithms;
     }
 
-    if (this.coreListPending) {
-      return this.coreListPending;
-    }
+    if (this.coreListPending) {}
 
     const promise = this.coreHasher
killedBy: AlgorithmService.resolveAlgorithm coalesces concurrent in-flight calls for different recipes into one core-list fetch
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ArithmeticOperator
src/application/service/algorithm.service.ts:105:55
     const promise = this.coreHasher
       .listAlgorithms()
       .then((algorithms) => {
-        this.coreListCache = { algorithms, expiresAt: Date.now() + this.cacheTtlMs };
+        this.coreListCache = { algorithms, expiresAt: Date.now() - this.cacheTtlMs };
 
         return algorithms;
killedBy: AlgorithmService.resolveAlgorithm reuses the core-list cache across different recipes resolved one after another
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/application/service/algorithm.service.ts:109:22
 
         return algorithms;
       })
-      .finally(() => {
-        this.coreListPending = null;
-      });
+      .finally(() => {});
 
     this.coreListPending = promise;
killedBy: AlgorithmService.resolveAlgorithm expires the core-list cache after the given TTL — a later call re-fetches from core
statusReason: expected "vi.fn()" to be called 2 times, but got 1 times
