[Killed] BlockStatement
src/presentation/http/errorResponse.ts:24:41
 import { HttpServerMessage } from './messages.js';
 
 export function sendErrorResponse(request: FastifyRequest, reply: FastifyReply, err: unknown): FastifyReply {
-  if (err instanceof UnauthorizedError) {
-    return reply.status(401).send({ error: err.message });
-  }
+  if (err instanceof UnauthorizedError) {}
   if (err instanceof ForbiddenError) {
     return reply.status(403).send({ error: err.message });
killedBy: end-to-end: upsert an asset, then find it as a duplicate rejects an unauthenticated request against a real server + DB
statusReason: expected 500 to be 401 // Object.is equality

[Killed] ObjectLiteral
src/presentation/http/errorResponse.ts:25:35
 
 export function sendErrorResponse(request: FastifyRequest, reply: FastifyReply, err: unknown): FastifyReply {
   if (err instanceof UnauthorizedError) {
-    return reply.status(401).send({ error: err.message });
+    return reply.status(401).send({});
   }
   if (err instanceof ForbiddenError) {
killedBy: sendErrorResponse maps UnauthorizedError: invalid or revoked API key to status 401
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
src/presentation/http/errorResponse.ts:27:38
   if (err instanceof UnauthorizedError) {
     return reply.status(401).send({ error: err.message });
   }
-  if (err instanceof ForbiddenError) {
-    return reply.status(403).send({ error: err.message });
-  }
+  if (err instanceof ForbiddenError) {}
   if (err instanceof ValidationError) {
     return reply.status(400).send({ error: err.message });
killedBy: POST /assets rejects a token lacking the assets:write scope
statusReason: expected 500 to be 403 // Object.is equality

[Killed] BlockStatement
src/presentation/http/errorResponse.ts:30:39
   if (err instanceof ForbiddenError) {
     return reply.status(403).send({ error: err.message });
   }
-  if (err instanceof ValidationError) {
-    return reply.status(400).send({ error: err.message });
-  }
+  if (err instanceof ValidationError) {}
   if (err instanceof NotFoundError) {
     return reply.status(404).send({ error: err.message });
killedBy: sendErrorResponse maps ValidationError: recipes must contain at least one recipe to status 400
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] BlockStatement
src/presentation/http/errorResponse.ts:33:37
   if (err instanceof ValidationError) {
     return reply.status(400).send({ error: err.message });
   }
-  if (err instanceof NotFoundError) {
-    return reply.status(404).send({ error: err.message });
-  }
+  if (err instanceof NotFoundError) {}
   if (err instanceof AlreadyExistsError) {
     return reply.status(409).send({ error: err.message });
killedBy: DELETE /assets maps a domain error thrown by the handler to the correct status code
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ObjectLiteral
src/presentation/http/errorResponse.ts:34:35
     return reply.status(400).send({ error: err.message });
   }
   if (err instanceof NotFoundError) {
-    return reply.status(404).send({ error: err.message });
+    return reply.status(404).send({});
   }
   if (err instanceof AlreadyExistsError) {
killedBy: sendErrorResponse maps NotFoundError: asset 'id=a1' not found to status 404
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
src/presentation/http/errorResponse.ts:36:42
   if (err instanceof NotFoundError) {
     return reply.status(404).send({ error: err.message });
   }
-  if (err instanceof AlreadyExistsError) {
-    return reply.status(409).send({ error: err.message });
-  }
+  if (err instanceof AlreadyExistsError) {}
   if (err instanceof AssetProcessingError) {
     return reply.status(422).send({ error: err.message });
killedBy: sendErrorResponse maps AlreadyExistsError: project with slug 'demo' already exists to status 409
statusReason: expected "vi.fn()" to be called with arguments: [ 409 ]

Received:

  1st vi.fn() call:

  [
-   409,

[Killed] ObjectLiteral
src/presentation/http/errorResponse.ts:37:35
     return reply.status(404).send({ error: err.message });
   }
   if (err instanceof AlreadyExistsError) {
-    return reply.status(409).send({ error: err.message });
+    return reply.status(409).send({});
   }
   if (err instanceof AssetProcessingError) {
killedBy: sendErrorResponse maps AlreadyExistsError: project with slug 'demo' already exists to status 409
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
src/presentation/http/errorResponse.ts:39:44
   if (err instanceof AlreadyExistsError) {
     return reply.status(409).send({ error: err.message });
   }
-  if (err instanceof AssetProcessingError) {
-    return reply.status(422).send({ error: err.message });
-  }
+  if (err instanceof AssetProcessingError) {}
   if (err instanceof AlgorithmContractError) {
     return reply.status(502).send({ error: err.message });
killedBy: sendErrorResponse maps AssetProcessingError: corrupt file to status 422
statusReason: expected "vi.fn()" to be called with arguments: [ 422 ]

Received:

  1st vi.fn() call:

  [
-   422,

[Killed] ObjectLiteral
src/presentation/http/errorResponse.ts:40:35
     return reply.status(409).send({ error: err.message });
   }
   if (err instanceof AssetProcessingError) {
-    return reply.status(422).send({ error: err.message });
+    return reply.status(422).send({});
   }
   if (err instanceof AlgorithmContractError) {
killedBy: sendErrorResponse maps AssetProcessingError: corrupt file to status 422
statusReason: expected "vi.fn()" to be called with arguments: [ { error: 'corrupt file' } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
src/presentation/http/errorResponse.ts:42:46
   if (err instanceof AssetProcessingError) {
     return reply.status(422).send({ error: err.message });
   }
-  if (err instanceof AlgorithmContractError) {
-    return reply.status(502).send({ error: err.message });
-  }
+  if (err instanceof AlgorithmContractError) {}
   if (err instanceof UnsupportedRecipeError) {
     return reply.status(501).send({ error: err.message });
killedBy: sendErrorResponse maps AlgorithmContractError: core does not report a recipe named 'image.phash16' via GET /algorithms to status 502
statusReason: expected "vi.fn()" to be called with arguments: [ 502 ]

Received:

  1st vi.fn() call:

  [
-   502,

[Killed] BlockStatement
src/presentation/http/errorResponse.ts:45:46
   if (err instanceof AlgorithmContractError) {
     return reply.status(502).send({ error: err.message });
   }
-  if (err instanceof UnsupportedRecipeError) {
-    return reply.status(501).send({ error: err.message });
-  }
+  if (err instanceof UnsupportedRecipeError) {}
   if (err instanceof CoreUnavailableError) {
     return reply.status(502).send({ error: err.message });
killedBy: sendErrorResponse maps UnsupportedRecipeError: recipe 'image.embedding' returned vectors — cosine/vector recipes aren't implemented in registry yet to status 501
statusReason: expected "vi.fn()" to be called with arguments: [ 501 ]

Received:

  1st vi.fn() call:

  [
-   501,

[Killed] BlockStatement
src/presentation/http/errorResponse.ts:48:44
   if (err instanceof UnsupportedRecipeError) {
     return reply.status(501).send({ error: err.message });
   }
-  if (err instanceof CoreUnavailableError) {
-    return reply.status(502).send({ error: err.message });
-  }
+  if (err instanceof CoreUnavailableError) {}
 
   request.log.error({ err }, HttpServerMessage.UNEXPECTED_ERROR);
killedBy: sendErrorResponse maps CoreUnavailableError: core returned an empty /hash response to status 502
statusReason: expected "vi.fn()" to be called with arguments: [ 502 ]

Received:

  1st vi.fn() call:

  [
-   502,

[Killed] ObjectLiteral
src/presentation/http/errorResponse.ts:49:35
     return reply.status(501).send({ error: err.message });
   }
   if (err instanceof CoreUnavailableError) {
-    return reply.status(502).send({ error: err.message });
+    return reply.status(502).send({});
   }
 
killedBy: sendErrorResponse maps CoreUnavailableError: core returned an empty /hash response to status 502
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   {
