[Killed] BooleanLiteral
src/presentation/parse.ts:23:7
   }
   const parsed = Number.parseInt(raw, 10);
 
-  if (!Number.isFinite(parsed) || parsed <= 0) {
+  if (Number.isFinite(parsed) || parsed <= 0) {
     throw ValidationError.notPositiveInteger(fieldName);
   }
killedBy: GET /duplicates/matches honors explicit page/page_size query params
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 2, 5 ]

Number of calls: 0

[Killed] EqualityOperator
src/presentation/parse.ts:23:35
   }
   const parsed = Number.parseInt(raw, 10);
 
-  if (!Number.isFinite(parsed) || parsed <= 0) {
+  if (!Number.isFinite(parsed) || parsed > 0) {
     throw ValidationError.notPositiveInteger(fieldName);
   }
killedBy: GET /duplicates/matches honors explicit page/page_size query params
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 2, 5 ]

Number of calls: 0

[Killed] ConditionalExpression
src/presentation/parse.ts:36:35
   }
   const parsed = Number.parseInt(raw, 10);
 
-  if (!Number.isFinite(parsed) || parsed <= 0) {
+  if (!Number.isFinite(parsed) || false) {
     throw ValidationError.notPositiveInteger(fieldName);
   }
killedBy: parseOptionalLimit rejects zero
statusReason: expected function to throw an error, but it didn't

[Killed] EqualityOperator
src/presentation/parse.ts:36:35
   }
   const parsed = Number.parseInt(raw, 10);
 
-  if (!Number.isFinite(parsed) || parsed <= 0) {
+  if (!Number.isFinite(parsed) || parsed < 0) {
     throw ValidationError.notPositiveInteger(fieldName);
   }
killedBy: parseOptionalLimit rejects zero
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/presentation/parse.ts:49:7
   }
   const parsed = Number.parseFloat(raw);
 
-  if (!isValidPercentage(parsed)) {
+  if (true) {
     throw ValidationError.percentageOutOfRange('threshold');
   }
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/presentation/parse.ts:49:7
   }
   const parsed = Number.parseFloat(raw);
 
-  if (!isValidPercentage(parsed)) {
+  if (false) {
     throw ValidationError.percentageOutOfRange('threshold');
   }
killedBy: parsePercentage rejects an out-of-range value
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/presentation/parse.ts:58:23
 
 export function parsePage(
   raw: { page?: string; pageSize?: string },
-  pageSizeFieldName = 'page_size',
+  pageSizeFieldName = "",
 ): { page: number; size: number } {
   const page = parsePositiveInt(raw.page, 1, 'page');
killedBy: parsePage defaults the pageSize error field name to page_size
statusReason: expected [Function] to throw error matching /page_size/ but got ' must be a positive integer'

[Killed] ConditionalExpression
src/presentation/parse.ts:63:7
   const page = parsePositiveInt(raw.page, 1, 'page');
   const size = parsePositiveInt(raw.pageSize, DEFAULT_PAGE_SIZE, pageSizeFieldName);
 
-  if (size > MAX_PAGE_SIZE) {
+  if (true) {
     throw ValidationError.exceedsMaximum(pageSizeFieldName, MAX_PAGE_SIZE);
   }
killedBy: parsePage defaults to page 1 and DEFAULT_PAGE_SIZE when nothing is given
statusReason: page_size must not exceed 100

[Killed] BlockStatement
src/presentation/parse.ts:63:29
   const page = parsePositiveInt(raw.page, 1, 'page');
   const size = parsePositiveInt(raw.pageSize, DEFAULT_PAGE_SIZE, pageSizeFieldName);
 
-  if (size > MAX_PAGE_SIZE) {
-    throw ValidationError.exceedsMaximum(pageSizeFieldName, MAX_PAGE_SIZE);
-  }
+  if (size > MAX_PAGE_SIZE) {}
 
   return { page, size };
killedBy: GET /duplicates/ranking rejects a page_size above the maximum allowed
statusReason: expected 500 to be 400 // Object.is equality
