[Killed] ArrowFunction
src/domain/validation/apiScope.validation.ts:13:32
 import { ApiScope } from '../model/apiClient.model.js';
 
 export function hasScope(apiClient: ApiClient, requiredScope: ApiScope): boolean {
-  return apiClient.scopes.some((scope) => scope === ApiScope.WILDCARD || scope === requiredScope);
+  return apiClient.scopes.some(() => undefined);
 }
 
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 403 to be 200 // Object.is equality

[Killed] LogicalOperator
src/domain/validation/apiScope.validation.ts:13:43
 import { ApiScope } from '../model/apiClient.model.js';
 
 export function hasScope(apiClient: ApiClient, requiredScope: ApiScope): boolean {
-  return apiClient.scopes.some((scope) => scope === ApiScope.WILDCARD || scope === requiredScope);
+  return apiClient.scopes.some((scope) => scope === ApiScope.WILDCARD && scope === requiredScope);
 }
 
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 403 to be 200 // Object.is equality
