[Killed] ConditionalExpression
src/infrastructure/logger.ts:12:7
 import { NodeEnv, type Env } from './env/env.js';
 
 export function resolveTransport(env: Env): { target: string; options?: Record<string, unknown> } | undefined {
-  if (env.NODE_ENV === NodeEnv.PRODUCTION) {
+  if (true) {
     return undefined;
   }
killedBy: resolveTransport writes to a file in test
statusReason: expected undefined to deeply equal { target: 'pino/file', …(1) }

[Killed] ConditionalExpression
src/infrastructure/logger.ts:12:7
 import { NodeEnv, type Env } from './env/env.js';
 
 export function resolveTransport(env: Env): { target: string; options?: Record<string, unknown> } | undefined {
-  if (env.NODE_ENV === NodeEnv.PRODUCTION) {
+  if (false) {
     return undefined;
   }
killedBy: resolveTransport returns undefined in production (structured JSON to stdout)
statusReason: expected { target: 'pino-pretty' } to be undefined

[Killed] ConditionalExpression
src/infrastructure/logger.ts:15:7
   if (env.NODE_ENV === NodeEnv.PRODUCTION) {
     return undefined;
   }
-  if (env.NODE_ENV === NodeEnv.TEST) {
+  if (true) {
     return { target: 'pino/file', options: { destination: 'var/logs/test.log', mkdir: true } };
   }
killedBy: resolveTransport uses pino-pretty in development
statusReason: expected { target: 'pino/file', …(1) } to deeply equal { target: 'pino-pretty' }

[Killed] BlockStatement
src/infrastructure/logger.ts:15:38
   if (env.NODE_ENV === NodeEnv.PRODUCTION) {
     return undefined;
   }
-  if (env.NODE_ENV === NodeEnv.TEST) {
-    return { target: 'pino/file', options: { destination: 'var/logs/test.log', mkdir: true } };
-  }
+  if (env.NODE_ENV === NodeEnv.TEST) {}
 
   return { target: 'pino-pretty' };
killedBy: resolveTransport writes to a file in test
statusReason: expected { target: 'pino-pretty' } to deeply equal { target: 'pino/file', …(1) }

[Killed] BooleanLiteral
src/infrastructure/logger.ts:16:87
     return undefined;
   }
   if (env.NODE_ENV === NodeEnv.TEST) {
-    return { target: 'pino/file', options: { destination: 'var/logs/test.log', mkdir: true } };
+    return { target: 'pino/file', options: { destination: 'var/logs/test.log', mkdir: false } };
   }
 
killedBy: resolveTransport writes to a file in test
statusReason: expected { target: 'pino/file', …(1) } to deeply equal { target: 'pino/file', …(1) }

[Killed] StringLiteral
src/infrastructure/logger.ts:16:22
     return undefined;
   }
   if (env.NODE_ENV === NodeEnv.TEST) {
-    return { target: 'pino/file', options: { destination: 'var/logs/test.log', mkdir: true } };
+    return { target: "", options: { destination: 'var/logs/test.log', mkdir: true } };
   }
 
killedBy: resolveTransport writes to a file in test
statusReason: expected { target: '', options: { …(2) } } to deeply equal { target: 'pino/file', …(1) }

[Killed] StringLiteral
src/infrastructure/logger.ts:19:20
     return { target: 'pino/file', options: { destination: 'var/logs/test.log', mkdir: true } };
   }
 
-  return { target: 'pino-pretty' };
+  return { target: "" };
 }
 
killedBy: resolveTransport uses pino-pretty in development
statusReason: expected { target: '' } to deeply equal { target: 'pino-pretty' }

[Killed] ObjectLiteral
src/infrastructure/logger.ts:23:10
 }
 
 export function createLoggerOptions(env: Env): Record<string, unknown> {
-  return {
-    level: env.LOG_LEVEL,
-    transport: resolveTransport(env),
-  };
+  return {};
 }
 
killedBy: createLoggerOptions uses the given LOG_LEVEL
statusReason: expected undefined to be 'debug' // Object.is equality
