[Killed] BlockStatement
src/application/command.gateway.ts:28:68
   private readonly handlers = new Map<CommandClass<any>, CommandHandler<any, any>>();
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  registerAll(handlers: readonly CommandHandler<any, any>[]): void {
-    for (const handler of handlers) {
-      this.register(handler);
-    }
-  }
+  registerAll(handlers: readonly CommandHandler<any, any>[]): void {}
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/application/command.gateway.ts:29:37
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
   registerAll(handlers: readonly CommandHandler<any, any>[]): void {
-    for (const handler of handlers) {
-      this.register(handler);
-    }
+    for (const handler of handlers) {}
   }
 
killedBy: CommandGateway registerAll registers every handler in the list
statusReason: promise rejected "CommandGatewayError: CommandGateway: no h…" instead of resolving

[Killed] CallExpression
src/application/command.gateway.ts:30:7
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
   registerAll(handlers: readonly CommandHandler<any, any>[]): void {
     for (const handler of handlers) {
-      this.register(handler);
+      ;
     }
   }
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/application/command.gateway.ts:35:53
   }
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
-  register(handler: CommandHandler<any, any>): void {
-    const commandClass = handler.commandClass;
-
-    if (this.handlers.has(commandClass)) {
-      throw CommandGatewayError.handlerAlreadyRegistered(commandClass.name);
-    }
-
-    this.handlers.set(commandClass, handler);
-  }
+  register(handler: CommandHandler<any, any>): void {}
 
   async dispatch<R>(command: Command<R>): Promise<R> {
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/application/command.gateway.ts:38:9
   register(handler: CommandHandler<any, any>): void {
     const commandClass = handler.commandClass;
 
-    if (this.handlers.has(commandClass)) {
+    if (true) {
       throw CommandGatewayError.handlerAlreadyRegistered(commandClass.name);
     }
killedBy: CommandGateway dispatches a command to its registered handler
statusReason: CommandGateway: handler already registered for Ping

[Killed] ConditionalExpression
src/application/command.gateway.ts:38:9
   register(handler: CommandHandler<any, any>): void {
     const commandClass = handler.commandClass;
 
-    if (this.handlers.has(commandClass)) {
+    if (false) {
       throw CommandGatewayError.handlerAlreadyRegistered(commandClass.name);
     }
killedBy: CommandGateway throws when registering two handlers for the same command class
statusReason: expected [Function] to throw an error

[Killed] CallExpression
src/application/command.gateway.ts:42:5
       throw CommandGatewayError.handlerAlreadyRegistered(commandClass.name);
     }
 
-    this.handlers.set(commandClass, handler);
+    ;
   }
 
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 500 to be 200 // Object.is equality
