[Killed] ConditionalExpression
src/application/handler/apiClient.handler.ts:24:9
   ) {}
 
   async create(command: CreateApiClient): Promise<CreateApiClientResult> {
-    if ((await this.apiClients.findByProjectAndName(command.projectId, command.name)) !== null) {
+    if (true) {
       throw AlreadyExistsError.apiClient(command.name);
     }
killedBy: ApiClientHandlers.create generates a raw key, hashes it, and delegates to the writer
statusReason: API client 'test' already exists for this project

[Killed] BlockStatement
src/application/handler/apiClient.handler.ts:24:97
   ) {}
 
   async create(command: CreateApiClient): Promise<CreateApiClientResult> {
-    if ((await this.apiClients.findByProjectAndName(command.projectId, command.name)) !== null) {
-      throw AlreadyExistsError.apiClient(command.name);
-    }
+    if ((await this.apiClients.findByProjectAndName(command.projectId, command.name)) !== null) {}
 
     const rawKey = randomBytes(32).toString('hex');
killedBy: ApiClientHandlers.create rejects when an active client with the same name already exists for the project
statusReason: promise resolved "{ apiClient: { …(7) }, …(1) }" instead of rejecting

[Killed] BlockStatement
src/application/handler/apiClient.handler.ts:40:57
     return { apiClient, rawKey };
   }
 
-  async revoke(command: RevokeApiClient): Promise<void> {
-    await this.apiClientWriter.revoke(command.id);
-  }
+  async revoke(command: RevokeApiClient): Promise<void> {}
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
killedBy: ApiClientHandlers.revoke delegates to the writer with the command id
statusReason: expected "vi.fn()" to be called with arguments: [ 'client-1' ]

Number of calls: 0
