[Killed] BlockStatement
src/application/handler/asset.handler.ts:59:43
 
     const results: AddRecipeResult[] = [];
 
-    for (const coreResult of coreResults) {
-      const algorithm = await this.algorithmService.resolveAlgorithm(coreResult.recipe);
-
-      results.push(await this.addRecipe(project, asset.id, algorithm, coreResult));
-    }
+    for (const coreResult of coreResults) {}
 
     return { identity: asset.identity, results };
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected { …(2) } to match object { …(2) }

[Killed] CallExpression
src/application/handler/asset.handler.ts:62:7
     for (const coreResult of coreResults) {
       const algorithm = await this.algorithmService.resolveAlgorithm(coreResult.recipe);
 
-      results.push(await this.addRecipe(project, asset.id, algorithm, coreResult));
+      ;
     }
 
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected { …(2) } to match object { …(2) }

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:74:86
     algorithm: Algorithm,
     coreResult: CoreHashResult,
   ): Promise<AddRecipeResult> {
-    const existing = (await this.assetHashes.findByAssetId(assetId)).filter((row) => row.algorithmId === algorithm.id);
+    const existing = (await this.assetHashes.findByAssetId(assetId)).filter((row) => true);
     const unchanged =
       existing.length === coreResult.hashes.length &&
killedBy: AssetHandlers.add ignores another algorithm's hash rows for the same asset when checking for a change
statusReason: expected 'updated' to be 'created' // Object.is equality

[Killed] EqualityOperator
src/application/handler/asset.handler.ts:74:86
     algorithm: Algorithm,
     coreResult: CoreHashResult,
   ): Promise<AddRecipeResult> {
-    const existing = (await this.assetHashes.findByAssetId(assetId)).filter((row) => row.algorithmId === algorithm.id);
+    const existing = (await this.assetHashes.findByAssetId(assetId)).filter((row) => row.algorithmId !== algorithm.id);
     const unchanged =
       existing.length === coreResult.hashes.length &&
killedBy: AssetHandlers.add detects a change even when only one of several hash sequences differs (not just when all differ)
statusReason: expected 'created' to be 'updated' // Object.is equality

[Killed] EqualityOperator
src/application/handler/asset.handler.ts:76:7
   ): Promise<AddRecipeResult> {
     const existing = (await this.assetHashes.findByAssetId(assetId)).filter((row) => row.algorithmId === algorithm.id);
     const unchanged =
-      existing.length === coreResult.hashes.length &&
+      existing.length !== coreResult.hashes.length &&
       existing.every((row) => row.hash === coreResult.hashes[row.sequenceIndex]);
 
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected { …(2) } to match object { …(2) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:76:7
   ): Promise<AddRecipeResult> {
     const existing = (await this.assetHashes.findByAssetId(assetId)).filter((row) => row.algorithmId === algorithm.id);
     const unchanged =
-      existing.length === coreResult.hashes.length &&
-      existing.every((row) => row.hash === coreResult.hashes[row.sequenceIndex]);
+      false;
 
     if (unchanged) {
killedBy: AssetHandlers.add is a no-op when the existing hash is unchanged
statusReason: expected [ { recipe: 'binary.sha256', …(2) } ] to deeply equal [ { recipe: 'binary.sha256', …(2) } ]

[Killed] ArrowFunction
src/application/handler/asset.handler.ts:77:22
     const existing = (await this.assetHashes.findByAssetId(assetId)).filter((row) => row.algorithmId === algorithm.id);
     const unchanged =
       existing.length === coreResult.hashes.length &&
-      existing.every((row) => row.hash === coreResult.hashes[row.sequenceIndex]);
+      existing.every(() => undefined);
 
     if (unchanged) {
killedBy: AssetHandlers.add is a no-op when the existing hash is unchanged
statusReason: expected [ { recipe: 'binary.sha256', …(2) } ] to deeply equal [ { recipe: 'binary.sha256', …(2) } ]

[Killed] MethodExpression
src/application/handler/asset.handler.ts:77:7
     const existing = (await this.assetHashes.findByAssetId(assetId)).filter((row) => row.algorithmId === algorithm.id);
     const unchanged =
       existing.length === coreResult.hashes.length &&
-      existing.every((row) => row.hash === coreResult.hashes[row.sequenceIndex]);
+      existing.some(row => row.hash === coreResult.hashes[row.sequenceIndex]);
 
     if (unchanged) {
killedBy: AssetHandlers.add detects a change even when only one of several hash sequences differs (not just when all differ)
statusReason: expected 'unchanged' to be 'updated' // Object.is equality

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:79:9
       existing.length === coreResult.hashes.length &&
       existing.every((row) => row.hash === coreResult.hashes[row.sequenceIndex]);
 
-    if (unchanged) {
+    if (false) {
       // Frequent update events (metadata changes without a change to the binary content) must
       // not trigger unnecessary similarity recomputation.
killedBy: AssetHandlers.add is a no-op when the existing hash is unchanged
statusReason: expected [ { recipe: 'binary.sha256', …(2) } ] to deeply equal [ { recipe: 'binary.sha256', …(2) } ]

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:79:9
       existing.length === coreResult.hashes.length &&
       existing.every((row) => row.hash === coreResult.hashes[row.sequenceIndex]);
 
-    if (unchanged) {
+    if (true) {
       // Frequent update events (metadata changes without a change to the binary content) must
       // not trigger unnecessary similarity recomputation.
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected { …(2) } to match object { …(2) }
(1 matching property omitted from actual)

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:85:9
       return { recipe: coreResult.recipe, hashes: coreResult.hashes, status: AssetAddStatus.UNCHANGED };
     }
 
-    if (existing.length > 0) {
+    if (false) {
       await this.assetHashDuplicateWriter.deleteByAsset(algorithm.id, assetId);
     }
killedBy: AssetHandlers.add deletes old duplicate rows and recomputes when the hash changed
statusReason: expected "vi.fn()" to be called with arguments: [ 1, 'asset-uuid-1' ]

Number of calls: 0

[Killed] EqualityOperator
src/application/handler/asset.handler.ts:85:9
       return { recipe: coreResult.recipe, hashes: coreResult.hashes, status: AssetAddStatus.UNCHANGED };
     }
 
-    if (existing.length > 0) {
+    if (existing.length >= 0) {
       await this.assetHashDuplicateWriter.deleteByAsset(algorithm.id, assetId);
     }
killedBy: AssetHandlers.add creates a new hash when none existed before
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      1,

[Killed] EqualityOperator
src/application/handler/asset.handler.ts:98:15
     return {
       recipe: coreResult.recipe,
       hashes: coreResult.hashes,
-      status: existing.length > 0 ? AssetAddStatus.UPDATED : AssetAddStatus.CREATED,
+      status: existing.length >= 0 ? AssetAddStatus.UPDATED : AssetAddStatus.CREATED,
     };
   }
killedBy: AssetHandlers.add creates a new hash when none existed before
statusReason: expected [ { recipe: 'binary.sha256', …(2) } ] to deeply equal [ { recipe: 'binary.sha256', …(2) } ]

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:98:15
     return {
       recipe: coreResult.recipe,
       hashes: coreResult.hashes,
-      status: existing.length > 0 ? AssetAddStatus.UPDATED : AssetAddStatus.CREATED,
+      status: true ? AssetAddStatus.UPDATED : AssetAddStatus.CREATED,
     };
   }
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected { …(2) } to match object { …(2) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/application/handler/asset.handler.ts:102:53
     };
   }
 
-  async delete(command: DeleteAsset): Promise<void> {
-    const asset = await this.assets.findByIdentity(command.projectId, command.identity);
-
-    if (asset === null) {
-      return;
-    }
-
-    const algorithmIds = new Set((await this.assetHashes.findByAssetId(asset.id)).map((hash) => hash.algorithmId));
-
-    for (const algorithmId of algorithmIds) {
-      await this.assetHashDuplicateWriter.deleteByAsset(algorithmId, asset.id);
-    }
-
-    await this.assetWriter.deleteByIdentity(command.projectId, command.identity);
-  }
+  async delete(command: DeleteAsset): Promise<void> {}
 
   /** The single place that decides exact-vs-hamming recompute behaviour — see `RecomputeAsset`'s doc comment. */
killedBy: AssetHandlers.delete deletes the asset row by identity — hash/duplicate rows cascade via FK
statusReason: expected "vi.fn()" to be called with arguments: [ 'project-1', …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/application/handler/asset.handler.ts:111:45
 
     const algorithmIds = new Set((await this.assetHashes.findByAssetId(asset.id)).map((hash) => hash.algorithmId));
 
-    for (const algorithmId of algorithmIds) {
-      await this.assetHashDuplicateWriter.deleteByAsset(algorithmId, asset.id);
-    }
+    for (const algorithmId of algorithmIds) {}
 
     await this.assetWriter.deleteByIdentity(command.projectId, command.identity);
killedBy: AssetHandlers.delete deletes duplicate rows for every algorithm the asset was hashed under
statusReason: expected "vi.fn()" to be called with arguments: [ 1, 'asset-uuid-1' ]

Number of calls: 0

[Killed] BlockStatement
src/application/handler/asset.handler.ts:119:64
   }
 
   /** The single place that decides exact-vs-hamming recompute behaviour — see `RecomputeAsset`'s doc comment. */
-  async recomputeAsset(command: RecomputeAsset): Promise<void> {
-    if (command.comparison === Comparison.EXACT) {
-      await this.assetHashDuplicateWriter.recomputeExact(command.projectId, command.algorithmId, command.assetId);
-
-      return;
-    }
-
-    if (command.comparison === Comparison.HAMMING) {
-      const minSimilarity = command.hammingThreshold ?? this.config.default_hamming_threshold;
-
-      await this.assetHashDuplicateWriter.recomputeHamming(
-        command.projectId,
-        command.algorithmId,
-        command.assetId,
-        minSimilarity,
-      );
-
-      return;
-    }
-
-    throw new Error(`comparison '${command.comparison}' has no application-layer implementation yet`);
-  }
+  async recomputeAsset(command: RecomputeAsset): Promise<void> {}
 
   async recomputeProject(command: RecomputeProject): Promise<number> {
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected { data: [], total_count: +0, …(6) } to match object { data: [ { …(2) } ], total_count: 1 }
(6 matching properties omitted from actual)

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:120:9
 
   /** The single place that decides exact-vs-hamming recompute behaviour — see `RecomputeAsset`'s doc comment. */
   async recomputeAsset(command: RecomputeAsset): Promise<void> {
-    if (command.comparison === Comparison.EXACT) {
+    if (false) {
       await this.assetHashDuplicateWriter.recomputeExact(command.projectId, command.algorithmId, command.assetId);
 
killedBy: AssetHandlers.recomputeAsset delegates exact-comparison recipes to recomputeExact
statusReason: comparison 'exact' has no application-layer implementation yet

[Killed] BlockStatement
src/application/handler/asset.handler.ts:120:50
 
   /** The single place that decides exact-vs-hamming recompute behaviour — see `RecomputeAsset`'s doc comment. */
   async recomputeAsset(command: RecomputeAsset): Promise<void> {
-    if (command.comparison === Comparison.EXACT) {
-      await this.assetHashDuplicateWriter.recomputeExact(command.projectId, command.algorithmId, command.assetId);
-
-      return;
-    }
+    if (command.comparison === Comparison.EXACT) {}
 
     if (command.comparison === Comparison.HAMMING) {
killedBy: AssetHandlers.recomputeAsset delegates exact-comparison recipes to recomputeExact
statusReason: comparison 'exact' has no application-layer implementation yet

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:126:9
       return;
     }
 
-    if (command.comparison === Comparison.HAMMING) {
+    if (true) {
       const minSimilarity = command.hammingThreshold ?? this.config.default_hamming_threshold;
 
killedBy: AssetHandlers.recomputeAsset throws for a comparison with no application-layer implementation yet
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/application/handler/asset.handler.ts:126:52
       return;
     }
 
-    if (command.comparison === Comparison.HAMMING) {
-      const minSimilarity = command.hammingThreshold ?? this.config.default_hamming_threshold;
-
-      await this.assetHashDuplicateWriter.recomputeHamming(
-        command.projectId,
-        command.algorithmId,
-        command.assetId,
-        minSimilarity,
-      );
-
-      return;
-    }
+    if (command.comparison === Comparison.HAMMING) {}
 
     throw new Error(`comparison '${command.comparison}' has no application-layer implementation yet`);
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/application/handler/asset.handler.ts:151:29
     for (;;) {
       const ids = await this.assets.listIdsWithHash(command.projectId, command.algorithmId, cursor, command.batchSize);
 
-      if (ids.length === 0) {
-        break;
-      }
+      if (ids.length === 0) {}
 
       for (const assetId of ids) {
killedBy: AssetHandlers.recomputeProject does not invoke onBatch again for the trailing empty batch after a full batch
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:151:11
     for (;;) {
       const ids = await this.assets.listIdsWithHash(command.projectId, command.algorithmId, cursor, command.batchSize);
 
-      if (ids.length === 0) {
+      if (true) {
         break;
       }
killedBy: AssetHandlers.recomputeProject deletes existing rows first, then walks assets in batches dispatching RecomputeAsset per asset
statusReason: expected "vi.fn()" to be called 3 times, but got 0 times

[Killed] BlockStatement
src/application/handler/asset.handler.ts:155:34
         break;
       }
 
-      for (const assetId of ids) {
-        await this.commandGateway.dispatch(
-          new RecomputeAsset(
-            command.projectId,
-            command.algorithmId,
-            command.comparison,
-            assetId,
-            command.hammingThreshold,
-          ),
-        );
-      }
+      for (const assetId of ids) {}
 
       processed += ids.length;
killedBy: AssetHandlers.recomputeProject deletes existing rows first, then walks assets in batches dispatching RecomputeAsset per asset
statusReason: expected "vi.fn()" to be called 3 times, but got 0 times

[Killed] AssignmentOperator
src/application/handler/asset.handler.ts:167:7
         );
       }
 
-      processed += ids.length;
+      processed -= ids.length;
       /* v8 ignore next -- unreachable: ids is non-empty here (the empty case already broke out above) */
       cursor = ids[ids.length - 1] ?? null;
killedBy: AssetHandlers.recomputeProject deletes existing rows first, then walks assets in batches dispatching RecomputeAsset per asset
statusReason: expected -3 to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/application/handler/asset.handler.ts:169:20
 
       processed += ids.length;
       /* v8 ignore next -- unreachable: ids is non-empty here (the empty case already broke out above) */
-      cursor = ids[ids.length - 1] ?? null;
+      cursor = ids[ids.length + 1] ?? null;
       command.onBatch?.(processed);
 
killedBy: AssetHandlers.recomputeProject advances the cursor to the last id of each batch
statusReason: expected 2nd "vi.fn()" call to have been called with [ 'p1', 1, 'a2', 2 ]

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:172:11
       cursor = ids[ids.length - 1] ?? null;
       command.onBatch?.(processed);
 
-      if (ids.length < command.batchSize) {
+      if (false) {
         break;
       }
killedBy: AssetHandlers.recomputeProject stops after a partial (less-than-batchSize) batch without an extra query
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/application/handler/asset.handler.ts:172:11
       cursor = ids[ids.length - 1] ?? null;
       command.onBatch?.(processed);
 
-      if (ids.length < command.batchSize) {
+      if (true) {
         break;
       }
killedBy: AssetHandlers.recomputeProject deletes existing rows first, then walks assets in batches dispatching RecomputeAsset per asset
statusReason: expected "vi.fn()" to be called 3 times, but got 2 times
