[Killed] CallExpression
src/application/handler/project.handler.ts:36:5
   async create(command: CreateProject): Promise<Project> {
     const recipes = dedupeRecipes(command.recipes);
 
-    assertValidRecipes(recipes);
+    ;
     assertValidHammingThreshold(command.hammingThreshold ?? null);
     assertValidRateLimitPerMinute(command.rateLimitPerMinute ?? null);
killedBy: ProjectHandlers.create rejects recipes without a binary.* entry
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] BlockStatement
src/application/handler/project.handler.ts:40:66
     assertValidHammingThreshold(command.hammingThreshold ?? null);
     assertValidRateLimitPerMinute(command.rateLimitPerMinute ?? null);
 
-    if ((await this.projects.findBySlug(command.slug)) !== null) {
-      throw AlreadyExistsError.project(command.slug);
-    }
+    if ((await this.projects.findBySlug(command.slug)) !== null) {}
 
     return this.projectWriter.create({
killedBy: ProjectHandlers.create rejects when a project with the same slug already exists
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] ConditionalExpression
src/application/handler/project.handler.ts:40:9
     assertValidHammingThreshold(command.hammingThreshold ?? null);
     assertValidRateLimitPerMinute(command.rateLimitPerMinute ?? null);
 
-    if ((await this.projects.findBySlug(command.slug)) !== null) {
+    if (true) {
       throw AlreadyExistsError.project(command.slug);
     }
killedBy: ProjectHandlers.create creates a project with deduped recipes
statusReason: project with slug 'demo' already exists

[Killed] LogicalOperator
src/application/handler/project.handler.ts:48:25
       slug: command.slug,
       name: command.name,
       recipes,
-      hammingThreshold: command.hammingThreshold ?? null,
+      hammingThreshold: command.hammingThreshold && null,
       rateLimitPerMinute: command.rateLimitPerMinute ?? null,
     });
killedBy: ProjectHandlers.create passes a real hammingThreshold/rateLimitPerMinute through unchanged (not coerced to null)
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] LogicalOperator
src/application/handler/project.handler.ts:49:27
       name: command.name,
       recipes,
       hammingThreshold: command.hammingThreshold ?? null,
-      rateLimitPerMinute: command.rateLimitPerMinute ?? null,
+      rateLimitPerMinute: command.rateLimitPerMinute && null,
     });
   }
killedBy: ProjectHandlers.create creates a project with deduped recipes
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,10 @@
  [

[Killed] BlockStatement
src/application/handler/project.handler.ts:56:32
   async updateSettings(command: UpdateProjectSettings): Promise<Project> {
     const recipes = command.recipes !== undefined ? dedupeRecipes(command.recipes) : undefined;
 
-    if (recipes !== undefined) {
-      assertValidRecipes(recipes);
-    }
+    if (recipes !== undefined) {}
 
     if (command.hammingThreshold !== undefined) {
killedBy: ProjectHandlers.updateSettings rejects an empty recipes list
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] CallExpression
src/application/handler/project.handler.ts:57:7
     const recipes = command.recipes !== undefined ? dedupeRecipes(command.recipes) : undefined;
 
     if (recipes !== undefined) {
-      assertValidRecipes(recipes);
+      ;
     }
 
killedBy: ProjectHandlers.updateSettings rejects an empty recipes list
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] BlockStatement
src/application/handler/project.handler.ts:60:49
       assertValidRecipes(recipes);
     }
 
-    if (command.hammingThreshold !== undefined) {
-      assertValidHammingThreshold(command.hammingThreshold);
-    }
+    if (command.hammingThreshold !== undefined) {}
 
     if (command.rateLimitPerMinute !== undefined) {
killedBy: ProjectHandlers.updateSettings rejects an invalid hammingThreshold
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] CallExpression
src/application/handler/project.handler.ts:61:7
     }
 
     if (command.hammingThreshold !== undefined) {
-      assertValidHammingThreshold(command.hammingThreshold);
+      ;
     }
 
killedBy: ProjectHandlers.updateSettings rejects an invalid hammingThreshold
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] BlockStatement
src/application/handler/project.handler.ts:64:51
       assertValidHammingThreshold(command.hammingThreshold);
     }
 
-    if (command.rateLimitPerMinute !== undefined) {
-      assertValidRateLimitPerMinute(command.rateLimitPerMinute);
-    }
+    if (command.rateLimitPerMinute !== undefined) {}
 
     const project = await this.projectWriter.updateSettings(command.id, {
killedBy: ProjectHandlers.updateSettings rejects a non-positive rateLimitPerMinute
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] CallExpression
src/application/handler/project.handler.ts:65:7
     }
 
     if (command.rateLimitPerMinute !== undefined) {
-      assertValidRateLimitPerMinute(command.rateLimitPerMinute);
+      ;
     }
 
killedBy: ProjectHandlers.updateSettings rejects a non-positive rateLimitPerMinute
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] ObjectLiteral
src/application/handler/project.handler.ts:68:73
       assertValidRateLimitPerMinute(command.rateLimitPerMinute);
     }
 
-    const project = await this.projectWriter.updateSettings(command.id, {
-      ...(recipes !== undefined && { recipes }),
-      ...(command.hammingThreshold !== undefined && { hammingThreshold: command.hammingThreshold }),
-      ...(command.rateLimitPerMinute !== undefined && { rateLimitPerMinute: command.rateLimitPerMinute }),
-    });
+    const project = await this.projectWriter.updateSettings(command.id, {});
 
     this.projectRateLimitCache.invalidate(command.id);
killedBy: ProjectHandlers.updateSettings dedupes and validates recipes when provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'p1', …(1) ]

Received:

  1st vi.fn() call:

  [
    "p1",

[Killed] ObjectLiteral
src/application/handler/project.handler.ts:70:53
 
     const project = await this.projectWriter.updateSettings(command.id, {
       ...(recipes !== undefined && { recipes }),
-      ...(command.hammingThreshold !== undefined && { hammingThreshold: command.hammingThreshold }),
+      ...(command.hammingThreshold !== undefined && {}),
       ...(command.rateLimitPerMinute !== undefined && { rateLimitPerMinute: command.rateLimitPerMinute }),
     });
killedBy: ProjectHandlers.updateSettings leaves recipes untouched when not provided
statusReason: expected "vi.fn()" to be called with arguments: [ 'p1', { hammingThreshold: 95 } ]

Received:

  1st vi.fn() call:

  [
    "p1",

[Killed] CallExpression
src/application/handler/project.handler.ts:74:5
       ...(command.rateLimitPerMinute !== undefined && { rateLimitPerMinute: command.rateLimitPerMinute }),
     });
 
-    this.projectRateLimitCache.invalidate(command.id);
+    ;
 
     return project;
killedBy: ProjectHandlers.updateSettings invalidates the rate-limit cache for this project
statusReason: expected "vi.fn()" to be called with arguments: [ 'p1' ]

Number of calls: 0

[Killed] BlockStatement
src/application/handler/project.handler.ts:79:55
     return project;
   }
 
-  async delete(command: DeleteProject): Promise<void> {
-    await this.projectWriter.deleteById(command.id);
-    this.projectRateLimitCache.invalidate(command.id);
-  }
+  async delete(command: DeleteProject): Promise<void> {}
 
   // eslint-disable-next-line @typescript-eslint/no-explicit-any
killedBy: ProjectHandlers.delete delegates to the writer
statusReason: expected "vi.fn()" to be called with arguments: [ 'p1' ]

Number of calls: 0

[Killed] CallExpression
src/application/handler/project.handler.ts:81:5
 
   async delete(command: DeleteProject): Promise<void> {
     await this.projectWriter.deleteById(command.id);
-    this.projectRateLimitCache.invalidate(command.id);
+    ;
   }
 
killedBy: ProjectHandlers.delete invalidates the rate-limit cache for this project
statusReason: expected "vi.fn()" to be called with arguments: [ 'p1' ]

Number of calls: 0
