[Killed] BlockStatement
src/domain/validation/project.validation.ts:15:61
 /** A project's `recipes` list must always include at least one `binary.*` recipe — core itself falls
  * back to that wildcard group when no other configured recipe applies, so a project without one could
  * end up with assets core silently declines to hash at all. */
-export function assertValidRecipes(recipes: string[]): void {
-  if (recipes.length === 0) {
-    throw ValidationError.recipesEmpty();
-  }
-
-  if (!recipes.some((recipe) => recipe.startsWith('binary.'))) {
-    throw ValidationError.recipesMissingBinary();
-  }
-}
+export function assertValidRecipes(recipes: string[]): void {}
 
 /** `null` means "fall back to the registry-wide config default" and is always valid. */
killedBy: ProjectHandlers.create rejects recipes without a binary.* entry
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] EqualityOperator
src/domain/validation/project.validation.ts:16:7
  * back to that wildcard group when no other configured recipe applies, so a project without one could
  * end up with assets core silently declines to hash at all. */
 export function assertValidRecipes(recipes: string[]): void {
-  if (recipes.length === 0) {
+  if (recipes.length !== 0) {
     throw ValidationError.recipesEmpty();
   }
killedBy: ProjectHandlers.create creates a project with deduped recipes
statusReason: recipes must contain at least one recipe

[Killed] ConditionalExpression
src/domain/validation/project.validation.ts:16:7
  * back to that wildcard group when no other configured recipe applies, so a project without one could
  * end up with assets core silently declines to hash at all. */
 export function assertValidRecipes(recipes: string[]): void {
-  if (recipes.length === 0) {
+  if (true) {
     throw ValidationError.recipesEmpty();
   }
killedBy: ProjectHandlers.create creates a project with deduped recipes
statusReason: recipes must contain at least one recipe

[Killed] MethodExpression
src/domain/validation/project.validation.ts:20:33
     throw ValidationError.recipesEmpty();
   }
 
-  if (!recipes.some((recipe) => recipe.startsWith('binary.'))) {
+  if (!recipes.some((recipe) => recipe.endsWith('binary.'))) {
     throw ValidationError.recipesMissingBinary();
   }
killedBy: buildContainer wires the full CQRS chain end to end: create a project via the real container
statusReason: recipes must contain at least one 'binary.*' recipe

[Killed] ArrowFunction
src/domain/validation/project.validation.ts:20:21
     throw ValidationError.recipesEmpty();
   }
 
-  if (!recipes.some((recipe) => recipe.startsWith('binary.'))) {
+  if (!recipes.some(() => undefined)) {
     throw ValidationError.recipesMissingBinary();
   }
killedBy: buildContainer wires the full CQRS chain end to end: create a project via the real container
statusReason: recipes must contain at least one 'binary.*' recipe

[Killed] BlockStatement
src/domain/validation/project.validation.ts:26:73
 }
 
 /** `null` means "fall back to the registry-wide config default" and is always valid. */
-export function assertValidHammingThreshold(value: number | null): void {
-  if (value === null) {
-    return;
-  }
-
-  if (!isValidPercentage(value)) {
-    throw ValidationError.percentageOutOfRange('hammingThreshold');
-  }
-}
+export function assertValidHammingThreshold(value: number | null): void {}
 
 /** `null` means "fall back to the registry-wide config default" and is always valid. */
killedBy: ProjectHandlers.create rejects an out-of-range hammingThreshold
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] BlockStatement
src/domain/validation/project.validation.ts:31:34
     return;
   }
 
-  if (!isValidPercentage(value)) {
-    throw ValidationError.percentageOutOfRange('hammingThreshold');
-  }
+  if (!isValidPercentage(value)) {}
 }
 
killedBy: ProjectHandlers.create rejects an out-of-range hammingThreshold
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] ConditionalExpression
src/domain/validation/project.validation.ts:31:7
     return;
   }
 
-  if (!isValidPercentage(value)) {
+  if (false) {
     throw ValidationError.percentageOutOfRange('hammingThreshold');
   }
killedBy: ProjectHandlers.create rejects an out-of-range hammingThreshold
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] BlockStatement
src/domain/validation/project.validation.ts:37:75
 }
 
 /** `null` means "fall back to the registry-wide config default" and is always valid. */
-export function assertValidRateLimitPerMinute(value: number | null): void {
-  if (value === null) {
-    return;
-  }
-
-  if (!Number.isInteger(value) || value <= 0) {
-    throw ValidationError.notPositiveInteger('rateLimitPerMinute');
-  }
-}
+export function assertValidRateLimitPerMinute(value: number | null): void {}
 
killedBy: ProjectHandlers.create rejects a non-positive rateLimitPerMinute
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] BooleanLiteral
src/domain/validation/project.validation.ts:42:7
     return;
   }
 
-  if (!Number.isInteger(value) || value <= 0) {
+  if (Number.isInteger(value) || value <= 0) {
     throw ValidationError.notPositiveInteger('rateLimitPerMinute');
   }
killedBy: ProjectHandlers.create passes a real hammingThreshold/rateLimitPerMinute through unchanged (not coerced to null)
statusReason: rateLimitPerMinute must be a positive integer

[Killed] ConditionalExpression
src/domain/validation/project.validation.ts:42:35
     return;
   }
 
-  if (!Number.isInteger(value) || value <= 0) {
+  if (!Number.isInteger(value) || false) {
     throw ValidationError.notPositiveInteger('rateLimitPerMinute');
   }
killedBy: ProjectHandlers.create rejects a non-positive rateLimitPerMinute
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting
