[Killed] ConditionalExpression
src/presentation/scopeResolver.ts:40:9
       throw NotFoundError.project(projectId);
     }
 
-    if (!project.recipes.includes(recipe)) {
+    if (false) {
       throw ValidationError.recipeNotConfigured(recipe);
     }
killedBy: ScopeResolver.resolveRecipeScope throws ValidationError when the recipe is not configured for the project
statusReason: promise resolved "{ project: { id: 'p1', …(7) }, …(1) }" instead of rejecting

[Killed] BlockStatement
src/presentation/scopeResolver.ts:40:44
       throw NotFoundError.project(projectId);
     }
 
-    if (!project.recipes.includes(recipe)) {
-      throw ValidationError.recipeNotConfigured(recipe);
-    }
+    if (!project.recipes.includes(recipe)) {}
 
     const algorithm = await this.algorithms.findByRecipe(recipe);
killedBy: ScopeResolver.resolveRecipeScope throws ValidationError when the recipe is not configured for the project
statusReason: promise resolved "{ project: { id: 'p1', …(7) }, …(1) }" instead of rejecting

[Killed] EqualityOperator
src/presentation/scopeResolver.ts:62:30
     const { project, algorithm } = await this.resolveRecipeScope(projectId, recipe);
     const fallback = project.hammingThreshold ?? this.config.default_hamming_threshold;
     const minSimilarity = parsePercentage(rawThreshold, fallback);
-    const thresholdIgnored = algorithm.comparison === Comparison.EXACT && rawThreshold !== undefined;
+    const thresholdIgnored = algorithm.comparison !== Comparison.EXACT && rawThreshold !== undefined;
 
     return { project, algorithm, minSimilarity, thresholdIgnored };
killedBy: ScopeResolver.resolveDuplicateScope flags thresholdIgnored when an explicit threshold is given for an exact-comparison recipe
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/presentation/scopeResolver.ts:62:75
     const { project, algorithm } = await this.resolveRecipeScope(projectId, recipe);
     const fallback = project.hammingThreshold ?? this.config.default_hamming_threshold;
     const minSimilarity = parsePercentage(rawThreshold, fallback);
-    const thresholdIgnored = algorithm.comparison === Comparison.EXACT && rawThreshold !== undefined;
+    const thresholdIgnored = algorithm.comparison === Comparison.EXACT && rawThreshold === undefined;
 
     return { project, algorithm, minSimilarity, thresholdIgnored };
killedBy: ScopeResolver.resolveDuplicateScope flags thresholdIgnored when an explicit threshold is given for an exact-comparison recipe
statusReason: expected false to be true // Object.is equality
