[Killed] ConditionalExpression
src/domain/validation/validation.ts:10:10
  * For the full license information, see the LICENSE file.
  */
 export function isValidPercentage(value: number): boolean {
-  return Number.isFinite(value) && value >= 0 && value <= 100;
+  return true;
 }
 
killedBy: ProjectHandlers.create rejects an out-of-range hammingThreshold
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting

[Killed] ConditionalExpression
src/domain/validation/validation.ts:10:10
  * For the full license information, see the LICENSE file.
  */
 export function isValidPercentage(value: number): boolean {
-  return Number.isFinite(value) && value >= 0 && value <= 100;
+  return true && value <= 100;
 }
 
killedBy: ProjectHandlers.updateSettings rejects an invalid hammingThreshold
statusReason: promise resolved "{ id: 'p1', slug: 'demo', …(6) }" instead of rejecting
