[Killed] ConditionalExpression
src/domain/model/asset.model.ts:44:15
   readonly path: string | null;
 
   constructor(id: string | null, path: string | null) {
-    this.id = id === '' ? null : id;
+    this.id = true ? null : id;
     this.path = path === '' ? null : path;
 
killedBy: DrizzleClusterSearchRepository paginate returns one cluster with both members and their avg similarity
statusReason: identity must have at least one of id or path set

[Killed] EqualityOperator
src/domain/model/asset.model.ts:44:15
   readonly path: string | null;
 
   constructor(id: string | null, path: string | null) {
-    this.id = id === '' ? null : id;
+    this.id = id !== '' ? null : id;
     this.path = path === '' ? null : path;
 
killedBy: DrizzleAssetHashDuplicateRepository recomputeExact creates a distance-0/similarity-100 row for assets sharing a hash
statusReason: identity must have at least one of id or path set

[Killed] EqualityOperator
src/domain/model/asset.model.ts:45:17
 
   constructor(id: string | null, path: string | null) {
     this.id = id === '' ? null : id;
-    this.path = path === '' ? null : path;
+    this.path = path !== '' ? null : path;
 
     if (this.id === null && this.path === null) {
killedBy: DrizzleClusterSearchRepository paginate filters to clusters containing a member whose path matches `*term*`
statusReason: identity must have at least one of id or path set

[Killed] ConditionalExpression
src/domain/model/asset.model.ts:45:17
 
   constructor(id: string | null, path: string | null) {
     this.id = id === '' ? null : id;
-    this.path = path === '' ? null : path;
+    this.path = true ? null : path;
 
     if (this.id === null && this.path === null) {
killedBy: DrizzleAssetRepository create creates a new asset row with path-only
statusReason: identity must have at least one of id or path set

[Killed] ConditionalExpression
src/domain/model/asset.model.ts:47:9
     this.id = id === '' ? null : id;
     this.path = path === '' ? null : path;
 
-    if (this.id === null && this.path === null) {
+    if (true) {
       throw ValidationError.identityEmpty();
     }
killedBy: DrizzleAssetHashDuplicateRepository recomputeExact creates a distance-0/similarity-100 row for assets sharing a hash
statusReason: identity must have at least one of id or path set

[Killed] ConditionalExpression
src/domain/model/asset.model.ts:47:9
     this.id = id === '' ? null : id;
     this.path = path === '' ? null : path;
 
-    if (this.id === null && this.path === null) {
+    if (true && this.path === null) {
       throw ValidationError.identityEmpty();
     }
killedBy: end-to-end: upsert an asset, then find it as a duplicate upserts two similar assets via HTTP and finds them as duplicates of each other
statusReason: expected 400 to be 200 // Object.is equality
